{
  "backend/main.mo": "Motoko actor that defines weather data types (WeatherResponse, WeeklyForecast, DBWeather) and provides query functions returning hardcoded mock weather data for city/country lookups.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive documentation listing all frontend component files with detailed summaries of their responsibilities, type usage, API integrations, and responsive design patterns.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light/dark themes and base styles for body and border elements.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx module script into a root div.",
  "frontend/src/App.tsx": "Main React application component managing location state, tab navigation (weather/farmer/driver/beach), weather data fetching, imminent alerts, backend publishing, and rendering themed UI with header, panels, and bottom navigation.",
  "frontend/src/components/BackgroundIllustration.tsx": "Component rendering weather-themed background images with smooth transitions and overlay gradients based on current weather theme (clear/cloudy/rain/snow).",
  "frontend/src/components/BeachMarineScreen.tsx": "Tab panel displaying marine and coastal conditions including wave height, wave period, water temperature, wind, and visibility using data from useMarineConditions hook.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with four tabs (weather, farmer, driver, beach) featuring icons, labels, and active state styling with glow effects.",
  "frontend/src/components/DriverWeatherPanel.tsx": "Displays driving-specific weather conditions including road ice risk, fog warnings, and route weather analysis with start/end location search functionality.",
  "frontend/src/components/FarmerGardenWeatherPanel.tsx": "Shows agricultural weather insights with humidity and temperature metrics in a card-based layout for farmers and gardeners.",
  "frontend/src/components/FloatingAutocompleteDropdown.tsx": "Portal-based floating dropdown component that positions itself relative to an anchor element with automatic flip-up behavior and click-outside handling.",
  "frontend/src/components/ImminentWeatherAlertBanner.tsx": "Renders dismissible weather alert banners with severity-based styling and icons for rain, snow, storm, or fog conditions.",
  "frontend/src/components/InitialRenderErrorBoundary.tsx": "React error boundary component that catches initial render errors and displays a fallback UI with refresh option and technical details.",
  "frontend/src/components/LanguageDropdownOverlay.tsx": "Portal-based language selector dropdown that toggles between Turkish and English locales with positioning and outside-click handling.",
  "frontend/src/components/LaundryDryingRecommendation.tsx": "Displays optimal time ranges for outdoor laundry drying based on weather conditions, showing best and alternative time windows.",
  "frontend/src/components/LocationSearch.tsx": "A location search component with autocomplete dropdown that allows users to search for locations using geocoding, displays the current selected location with admin/country details, and provides clear functionality.",
  "frontend/src/components/radar/RadarAlertBanner.tsx": "A dismissible alert banner component that displays radar alerts with severity-based styling (default or destructive) and localized title/message content.",
  "frontend/src/components/radar/RadarAlertControls.tsx": "A sheet-based settings panel for configuring radar alerts, allowing users to enable/disable alerts and adjust the alert radius (5-20 km) with a slider.",
  "frontend/src/components/radar/RadarEmptyState.tsx": "Displays an empty state UI with a cloud icon and localized message when no radar data or location is available.",
  "frontend/src/components/radar/RadarForecastLabel.tsx": "A centered overlay label that displays a warning icon and uncertainty message for radar forecast data.",
  "frontend/src/components/radar/RadarFrameModeToggle.tsx": "Empty file with no content.",
  "frontend/src/components/radar/RadarInfoPanel.tsx": "Displays a grid of radar summary information including start time, duration, precipitation intensity, and movement direction computed from radar data.",
  "frontend/src/components/radar/RadarLayerToggles.tsx": "A sheet-based control panel with switches to toggle visibility of different radar layers (precipitation, storm, snow, wind, temperature, air quality).",
  "frontend/src/components/radar/RadarMap.tsx": "React component that renders an interactive Leaflet map displaying precipitation radar frames, weather overlays (temperature, wind, storm, snow, air quality), and location markers with dynamic layer management.",
  "frontend/src/components/radar/RadarOverlayStatus.tsx": "Displays loading, error, and no-data status alerts for radar overlay layers (storm, snow, air quality) positioned above the radar map.",
  "frontend/src/components/radar/RadarPlaybackControls.tsx": "Empty file placeholder for radar playback controls component.",
  "frontend/src/components/RadarScreen.tsx": "Empty file with no content.",
  "frontend/src/components/RouteLocationSearch.tsx": "A labeled location search component similar to LocationSearch but designed for route planning, allowing selection and clearing of origin/destination locations with autocomplete functionality.",
  "frontend/src/components/ThemeProvider.tsx": "A React context provider that manages weather-based themes (clear, cloudy, rain, snow) and applies dark mode styling based on the current weather theme.",
  "frontend/src/components/WeatherPanel.tsx": "Displays comprehensive weather information including current conditions, temperature, humidity, wind, visibility, UV index, AQI, and a 7-day forecast with laundry drying recommendations.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useGeocodingSearch.ts": "Hook that provides debounced location search using Open-Meteo geocoding API with 500ms delay and 2-character minimum query length.",
  "frontend/src/hooks/useImminentWeatherAlerts.ts": "Manages imminent weather alerts with 30-minute dismissal cooldown, session storage persistence, and optional Android WebView bridge notifications with 5-minute cooldown.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication with AuthClient, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useMarineConditions.ts": "React Query hook that fetches marine/beach conditions from Open-Meteo Marine API with 5-minute stale time and 10-minute refetch interval.",
  "frontend/src/hooks/usePersistedLocation.ts": "Hook that manages user's selected location in localStorage with save, load, and clear operations for SavedLocation objects.",
  "frontend/src/hooks/usePublishWidgetWeather.ts": "Mutation hook that publishes weather data to backend for Android widget HTTP endpoint consumption, gracefully handling failures without throwing errors.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file documenting that all data fetching is done client-side via feature-specific hooks (Open-Meteo APIs and RainViewer).",
  "frontend/src/hooks/useRadarAlerts.ts": "Manages radar-based weather alerts with configurable radius settings, detects heavy precipitation conditions, and handles alert dismissal with session state persistence.",
  "frontend/src/hooks/useRadarOverlayData.ts": "React Query hook that fetches weather overlay data (temperature, wind, precipitation, air quality) from Open-Meteo APIs for a given location, including a temperature grid for heatmap visualization.",
  "frontend/src/hooks/useRadarPlayback.ts": "Custom hook managing radar animation playback state with play/pause, frame seeking, and auto-looping functionality at 500ms intervals.",
  "frontend/src/hooks/useRainViewer.ts": "React Query hook that fetches and caches RainViewer radar data from a backend-cached endpoint, with validation and 5-minute refresh intervals.",
  "frontend/src/hooks/useRouteWeatherAnalysis.ts": "React Query hook that interpolates points between start and end locations, fetches weather data for each point, and analyzes route weather conditions.",
  "frontend/src/hooks/useSessionState.ts": "Custom hook providing sessionStorage-backed state management with automatic persistence and JSON serialization.",
  "frontend/src/hooks/useWeather.ts": "React Query hook that fetches and transforms weather and air quality data from Open-Meteo, including current conditions, hourly forecasts, and daily forecasts with pressure trend calculations.",
  "frontend/src/i18n/I18nProvider.tsx": "React context provider for internationalization that manages locale state (Turkish/English) with localStorage persistence and provides translation function.",
  "frontend/src/i18n/translations.ts": "Translation dictionary containing Turkish and English strings for all UI elements including weather conditions, navigation, advisories, and error messages.",
  "frontend/src/i18n/useI18n.ts": "Custom hook that provides access to the I18n context for locale management and translation functions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes and weather-specific themes (rain, snow, clear, cloudy), plus utility classes for glass-morphism effects.",
  "frontend/src/lib/clothingAdvisories.ts": "Generates clothing recommendations (coat, light clothing, umbrella, wind protection) based on temperature, wind speed, and precipitation forecasts for the next 3 hours.",
  "frontend/src/lib/driverAdvisories.ts": "Calculates road ice risk and fog warnings for drivers by analyzing temperature, precipitation, humidity, and cloud cover data over the next 6-12 hours.",
  "frontend/src/lib/farmerAdvisories.ts": "Provides agricultural advisories including frost warnings, soil moisture status, precipitation forecasts, planting conditions, and spraying safety based on weather data analysis.",
  "frontend/src/lib/fetchWithTimeout.ts": "Wrapper function for fetch API that adds configurable timeout support using AbortController with a default 10-second timeout.",
  "frontend/src/lib/formatDailyForecastDate.ts": "Formats ISO date strings into localized short date format (e.g., 'Mon, Jan 15') supporting English and Turkish locales.",
  "frontend/src/lib/imminentWeatherAlerts.ts": "Evaluates the next 60 minutes of weather data to generate imminent alerts for severe weather conditions (storm, snow, rain, fog) with appropriate severity levels.",
  "frontend/src/lib/laundryDrying.ts": "Calculates laundry drying scores and recommendations based on temperature, humidity, wind speed, and precipitation, identifying optimal time ranges for outdoor drying over the next 24 hours.",
  "frontend/src/lib/openMeteo.ts": "Defines TypeScript interfaces and functions to fetch weather data from the Open-Meteo API, including current conditions, hourly forecasts, daily forecasts, air quality, and geocoding results.",
  "frontend/src/lib/openMeteoMarine.ts": "Fetches marine conditions (wave height, period, direction, sea surface temperature, wind, and visibility) from Open-Meteo Marine and Forecast APIs, with fallback visibility estimation based on humidity.",
  "frontend/src/lib/radarNowcastSummary.ts": "Computes a radar nowcast summary including start time, duration, intensity, and direction based on RainViewer radar frames and current playback state.",
  "frontend/src/lib/radarOverlays.ts": "Provides display parameters (radius, color, opacity) for various radar overlay types (storm, snow, wind, temperature, air quality) based on weather data values.",
  "frontend/src/lib/rainviewer.ts": "Parses and normalizes RainViewer radar data, filtering nowcast frames to a 90-minute future window and providing utilities to find the initial playback frame index.",
  "frontend/src/lib/rainviewerCache.ts": "Manages sessionStorage caching of RainViewer data with a 5-minute expiration, including normalization for backward compatibility with older cache formats.",
  "frontend/src/lib/routeAnalysis.ts": "Analyzes weather data along a route to identify risk factors (freezing, fog, precipitation, wind) and computes an overall risk level (safe, caution, danger) with severity scores.",
  "frontend/src/lib/tirePressure.ts": "Calculates tire pressure recommendations based on temperature and vehicle type, adjusting PSI relative to a 20°C reference temperature with localized explanation keys.",
  "frontend/src/lib/weatherContrast.ts": "Determines if a weather theme (clear, cloudy, rain, snow) should be treated as having a dark background, returning true for rain and snow themes.",
  "frontend/src/lib/weatherTheme.ts": "Maps WMO weather codes to weather themes, Lucide icons, and translation keys for weather condition descriptions.",
  "frontend/src/lib/widgetWeatherPayload.ts": "Transforms frontend WeatherData into backend-compatible WeatherResponse format and generates stable location-based keys for caching weather data.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrapping the App component.",
  "frontend/src/types/androidBridge.d.ts": "TypeScript declaration file defining the Android bridge interface for showing notifications from WebView.",
  "frontend/src/vite-env.d.ts": "Vite client types reference for TypeScript environment definitions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, animations, shadows, and plugins for the design system.",
  "frontend/tsconfig.node.json": "TypeScript configuration for Node.js build tools (Vite config) with ESNext module resolution.",
  "frontend/vite.config.ts": "Vite configuration with React plugin, path aliases, dev server on port 3000 with API proxy, and build output settings.",
  "project_state.json": "Project state tracking document indicating a fix is needed to wrap App with I18nProvider in main.tsx to resolve useI18n hook error."
}