{
  "backend/main.mo": "Actor defining weather data types and mock query endpoints for current, daily, and weekly forecasts with simple cached structures.",
  "backend/migration.mo": "Migration module transforming old actor state to new format by adding a rainViewer metadata cache.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files and utilities.",
  "frontend/index.css": "Global Tailwind base styles defining light/dark CSS variables and applying theme tokens across the app.",
  "frontend/index.html": "Basic HTML entry point with root container and main script loader.",
  "frontend/src/App.tsx": "Main React app managing location, weather fetching, alerting, theme selection, and backend publishing of widget data.",
  "frontend/src/components/BackgroundIllustration.tsx": "Displays transitioning weather‑themed background images with light/dark gradient overlays.",
  "frontend/src/components/BeachMarineScreen.tsx": "Marine conditions panel showing sea temperature, waves, wind, and visibility with loading, error, and empty states.",
  "frontend/src/components/BottomNav.tsx": "Responsive bottom navigation bar with five tabs and active-state styling using icons and i18n labels.",
  "frontend/src/components/DriverWeatherPanel.tsx": "Displays driver-focused weather advisories, route analysis, and risk cards with loading and error states.",
  "frontend/src/components/FarmerGardenWeatherPanel.tsx": "Shows agriculture-related weather advisories like frost, soil moisture, precipitation, and planting with loading and error handling.",
  "frontend/src/components/FloatingAutocompleteDropdown.tsx": "A floating dropdown positioned relative to an anchor element with dynamic height, scroll handling, and outside-click dismissal.",
  "frontend/src/components/ImminentWeatherAlertBanner.tsx": "Banner component showing imminent weather alerts with severity-based styling, icons, and a dismiss button.",
  "frontend/src/components/InitialRenderErrorBoundary.tsx": "Error boundary that catches initial render failures and displays a fallback UI with reload option and technical details.",
  "frontend/src/components/LanguageDropdownOverlay.tsx": "Floating language selector overlay positioned relative to a trigger button with outside-click and escape handling.",
  "frontend/src/components/LaundryDryingRecommendation.tsx": "Displays best and alternative laundry drying times based on weather data, with i18n text and styled cards.",
  "frontend/src/components/LocationSearch.tsx": "Provides a searchable location selector with autocomplete, current selection display, and clear functionality.",
  "frontend/src/components/radar/RadarAlertBanner.tsx": "Displays an alert banner with translated severity messages and a dismiss button.",
  "frontend/src/components/radar/RadarAlertControls.tsx": "Provides UI for enabling radar alerts and adjusting alert radius via a settings sheet.",
  "frontend/src/components/radar/RadarEmptyState.tsx": "Displays a centered empty-state view for the radar screen using translated text and an icon.",
  "frontend/src/components/radar/RadarFrameModeToggle.tsx": "Provides a toggle UI to switch between forecast and past radar frame modes with icons and translations.",
  "frontend/src/components/radar/RadarInfoPanel.tsx": "Shows computed radar summary details such as start time, duration, intensity, and direction for the current location.",
  "frontend/src/components/radar/RadarLayerToggles.tsx": "Renders a side sheet allowing users to enable or disable various radar overlay layers via switches.",
  "frontend/src/components/radar/RadarMap.tsx": "Initializes and manages a Leaflet map, markers, and radar/weather overlay layers based on location and enabled layers.",
  "frontend/src/components/radar/RadarOverlayStatus.tsx": "Displays loading, error, or no‑data status messages for non‑precipitation radar overlay layers.",
  "frontend/src/components/radar/RadarPlaybackControls.tsx": "Provides slider and button controls for navigating radar frames, including play/pause and previous/next actions.",
  "frontend/src/components/RadarScreen.tsx": "Renders the full radar interface including maps, playback, alerts, and location search, using RainViewer and overlay data.",
  "frontend/src/components/RouteLocationSearch.tsx": "Autocomplete input for selecting route endpoints with loading, error, and clear support.",
  "frontend/src/components/ThemeProvider.tsx": "Supplies a weather-based theme context and applies light or dark mode styling.",
  "frontend/src/components/WeatherPanel.tsx": "Shows detailed weather info, advisories, air quality, UV index, and laundry recommendations, with loading and error states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useGeocodingSearch.ts": "Performs debounced geocoding queries and returns matching location results with loading and error states.",
  "frontend/src/hooks/useImminentWeatherAlerts.ts": "Evaluates imminent weather alerts, manages dismissal cooldowns, and triggers optional Android bridge notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handles login, logout, and stored identity loading using Dfinity AuthClient.",
  "frontend/src/hooks/useMarineConditions.ts": "Fetches marine conditions from Open-Meteo using React Query based on latitude and longitude.",
  "frontend/src/hooks/usePersistedLocation.ts": "Manages a saved location in localStorage with getters, setters, and clearing capability.",
  "frontend/src/hooks/usePublishWidgetWeather.ts": "Publishes weather data to the backend via mutation, exposing publish status and errors.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder noting that feature-specific hooks handle all queries.",
  "frontend/src/hooks/useRadarAlerts.ts": "Detects radar-based severe weather alerts and manages alert settings, active alerts, and dismissals.",
  "frontend/src/hooks/useRadarOverlayData.ts": "Fetches weather, air quality, and temperature grid data for radar overlay visualization.",
  "frontend/src/hooks/useRadarPlayback.ts": "Controls radar frame playback with play, pause, seeking, and frame label helpers.",
  "frontend/src/hooks/useRainViewer.ts": "Retrieves RainViewer radar data using backend proxy with caching and refresh logic.",
  "frontend/src/hooks/useRouteWeatherAnalysis.ts": "Fetches interpolated route weather and analyzes conditions along start-to-end route points.",
  "frontend/src/hooks/useSessionState.ts": "Syncs a state value with sessionStorage, reading and writing automatically.",
  "frontend/src/hooks/useWeather.ts": "Fetches weather and air-quality data, transforms it into a normalized WeatherData shape, and exposes it via a React Query hook.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides locale state, persistence, and translation lookup through a React context.",
  "frontend/src/i18n/translations.ts": "Defines Turkish translation strings for UI text and weather-related labels.",
  "frontend/src/i18n/useI18n.ts": "Exports a hook that returns the I18n context and enforces usage within the provider.",
  "frontend/src/index.css": "Sets global Tailwind-based styles, themes, and weather‑dependent color variants.",
  "frontend/src/lib/clothingAdvisories.ts": "Computes clothing recommendations based on temperature, precipitation, wind, and near‑term forecast.",
  "frontend/src/lib/driverAdvisories.ts": "Generates driver risk advisories for road ice and fog using current and hourly weather data.",
  "frontend/src/lib/farmerAdvisories.ts": "Produces agricultural advisories such as frost, soil moisture, precipitation, planting, and spraying guidance.",
  "frontend/src/lib/fetchWithTimeout.ts": "Provides a fetch wrapper that aborts requests after a timeout and throws a custom timeout error.",
  "frontend/src/lib/formatDailyForecastDate.ts": "Formats an ISO date into a localized short weekday-month-day string.",
  "frontend/src/lib/imminentWeatherAlerts.ts": "Analyzes the next hour of weather data to detect imminent rain, snow, storm, or fog alerts.",
  "frontend/src/lib/laundryDrying.ts": "Calculates hourly drying scores and classifications based on weather conditions and identifies optimal drying time ranges.",
  "frontend/src/lib/openMeteo.ts": "Fetches and normalizes weather data from the Open‑Meteo API into a unified WeatherData structure.",
  "frontend/src/lib/openMeteoMarine.ts": "Retrieves marine and supplemental weather data to produce current sea and wind conditions with fallback visibility estimation.",
  "frontend/src/lib/radarNowcastSummary.ts": "Computes a simple radar precipitation summary including start time, duration, intensity, and direction.",
  "frontend/src/lib/radarOverlays.ts": "Generates visual overlay parameters for storm, snow, wind, temperature, and air‑quality radar layers.",
  "frontend/src/lib/rainviewer.ts": "Converts backend RainViewer metadata to frontend format, splits frames by time, and determines initial playback frame.",
  "frontend/src/lib/rainviewerCache.ts": "Manages sessionStorage caching for RainViewer data with validation, normalization, expiration, and forecast usability checks.",
  "frontend/src/lib/routeAnalysis.ts": "Analyzes weather data along a route to produce risk factors and an overall safety rating.",
  "frontend/src/lib/tirePressure.ts": "Generates tire pressure adjustment guidance based on temperature and vehicle type.",
  "frontend/src/lib/weatherContrast.ts": "Determines whether a weather theme should use a dark background.",
  "frontend/src/lib/weatherTheme.ts": "Maps WMO weather codes to themes, icons, and translation keys for descriptions.",
  "frontend/src/lib/widgetWeatherPayload.ts": "Builds backend-ready weather payloads and stable location keys from frontend weather data.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/types/androidBridge.d.ts": "Declares the Android bridge interface for triggering native notifications.",
  "frontend/src/vite-env.d.ts": "Provides Vite type declarations.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, plugins, colors, and responsive settings.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related Vite build files.",
  "frontend/vite.config.ts": "Vite configuration with React plugin, path aliases, dev server proxy, and build settings.",
  "project_state.json": "Tracks project version, architecture notes, issues, and pending feature requests for a RainViewer‑based radar/nowcast backend and frontend. Describes caching, proxying, nowcast generation, and UX requirements."
}