{
  "backend/main.mo": "Motoko actor defining weather types and mock query methods for current, daily, and weekly forecasts with a simple in-memory cache.",
  "backend/migration.mo": "Migration module converting an old cache entry format into a new one with a validity flag and default handling.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-written summaries describing the purpose and functionality of various frontend files.",
  "frontend/index.css": "Tailwind-based global style sheet defining color variables, dark mode tokens, and base layout rules.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component managing location, weather fetching, theming, alerts, tab navigation, and backend publishing.",
  "frontend/src/components/BackgroundIllustration.tsx": "Component rendering weather-themed background images with fade transitions and theme-based overlay shading.",
  "frontend/src/components/BeachMarineScreen.tsx": "Displays marine conditions for a selected beach location with loading, error, and empty states, showing temperature, waves, and other metrics.",
  "frontend/src/components/BottomNav.tsx": "Renders a bottom navigation bar with tabs for different app sections and handles tab switching.",
  "frontend/src/components/DriverWeatherPanel.tsx": "Shows driving-related weather advisories, route analysis, and loading/error states based on current and route-specific weather data.",
  "frontend/src/components/FarmerGardenWeatherPanel.tsx": "Displays agriculture-focused weather advisories including frost, soil, precipitation, planting, and spraying guidance.",
  "frontend/src/components/FloatingAutocompleteDropdown.tsx": "Renders a floating dropdown positioned relative to an anchor, updating on scroll/resize and closing on outside click.",
  "frontend/src/components/ImminentWeatherAlertBanner.tsx": "Shows a dismissible banner for imminent weather alerts with severity-based styling and icons.",
  "frontend/src/components/InitialRenderErrorBoundary.tsx": "Error boundary that catches initial render errors and displays a fallback UI with reload option and optional error details.",
  "frontend/src/components/LanguageDropdownOverlay.tsx": "Renders a portal-based language selection dropdown positioned relative to a trigger button and closes on outside click or escape.",
  "frontend/src/components/LaundryDryingRecommendation.tsx": "Displays best and alternative laundry drying times or a warning when conditions are unfavorable, based on weather data.",
  "frontend/src/components/LocationSearch.tsx": "Provides a searchable location input with autocomplete results and displays or clears the currently selected location.",
  "frontend/src/components/radar/RadarAlertBanner.tsx": "Displays a dismissible alert banner for radar alerts with severity-based styling.",
  "frontend/src/components/radar/RadarAlertControls.tsx": "Provides a settings panel to enable alerts and adjust alert radius via a sheet UI.",
  "frontend/src/components/radar/RadarEmptyState.tsx": "Shows an empty-state message when no radar data is available.",
  "frontend/src/components/radar/RadarForecastLabel.tsx": "Renders a centered warning label indicating forecast uncertainty.",
  "frontend/src/components/radar/RadarFrameModeToggle.tsx": "Toggle UI to switch between forecast and past radar frame modes.",
  "frontend/src/components/radar/RadarInfoPanel.tsx": "Displays summarized radar information such as start time, duration, intensity, and direction.",
  "frontend/src/components/radar/RadarLayerToggles.tsx": "Sheet UI for enabling or disabling various radar overlay layers.",
  "frontend/src/components/radar/RadarMap.tsx": "Initializes and updates a Leaflet map with location markers and dynamic radar/overlay layers.",
  "frontend/src/components/radar/RadarOverlayStatus.tsx": "Shows loading, error, or no‑data messages related to non-precipitation overlay layers.",
  "frontend/src/components/radar/RadarPlaybackControls.tsx": "Provides playback controls and a timeline slider for navigating radar frames.",
  "frontend/src/components/RadarScreen.tsx": "Combines radar map, playback, overlays, alerts, and location search to display interactive past and forecast radar frames.",
  "frontend/src/components/RouteLocationSearch.tsx": "Searches for route locations with autocomplete and allows selecting or clearing a chosen location.",
  "frontend/src/components/ThemeProvider.tsx": "Provides a weather-based theme context and wraps children with dark or light mode styling.",
  "frontend/src/components/WeatherPanel.tsx": "Shows current weather details, air quality, UV info, advisories, and laundry recommendations with loading and error states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating queries on change.",
  "frontend/src/hooks/useGeocodingSearch.ts": "Debounces user input and performs geocoding queries with caching and retry logic.",
  "frontend/src/hooks/useImminentWeatherAlerts.ts": "Manages imminent weather alerts with dismissal persistence and Android bridge notifications using sessionStorage and evaluated alert data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity login, state management, and persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useMarineConditions.ts": "Fetches marine condition data via React Query using Open-Meteo Marine API based on coordinates.",
  "frontend/src/hooks/usePersistedLocation.ts": "Handles saving, loading, and clearing a persisted location in localStorage.",
  "frontend/src/hooks/usePublishWidgetWeather.ts": "Provides a mutation to publish weather data to the backend for widget use, with graceful error handling.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that query hooks are implemented elsewhere.",
  "frontend/src/hooks/useRadarAlerts.ts": "Generates radar-based severe weather alerts using simple heuristics and stores user alert settings and dismissals.",
  "frontend/src/hooks/useRadarOverlayData.ts": "Fetches weather, air quality, and temperature grid data to produce overlay information for radar maps.",
  "frontend/src/hooks/useRadarPlayback.ts": "Controls radar animation playback with play, pause, seek, and frame label helpers.",
  "frontend/src/hooks/useRainViewer.ts": "Fetches and validates RainViewer radar data via backend actor with caching and React Query.",
  "frontend/src/hooks/useRouteWeatherAnalysis.ts": "Interpolates route points, fetches weather for each, transforms the data, and runs a route weather analysis via react-query.",
  "frontend/src/hooks/useSessionState.ts": "A hook that syncs a React state value with sessionStorage using a key and default value.",
  "frontend/src/hooks/useWeather.ts": "Fetches weather and air quality data, transforms it into a structured WeatherData object, and exposes it via react-query.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides locale state, persistence, and translation lookup via a React context.",
  "frontend/src/i18n/translations.ts": "Contains Turkish and English translation keys and text used throughout the UI.",
  "frontend/src/i18n/useI18n.ts": "A hook that retrieves the I18n context and throws if used outside the provider.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, weather-based color variants, and glass-like UI utilities.",
  "frontend/src/lib/clothingAdvisories.ts": "Generates clothing recommendations based on temperature, precipitation, and wind using weather data.",
  "frontend/src/lib/driverAdvisories.ts": "Computes road ice and fog risk levels using current and near-term weather conditions.",
  "frontend/src/lib/farmerAdvisories.ts": "Defines advisory interfaces and computes frost, soil moisture, precipitation, planting, and spraying recommendations based on hourly weather data.",
  "frontend/src/lib/fetchWithTimeout.ts": "Wraps fetch with an AbortController to add a configurable timeout and standardized timeout error.",
  "frontend/src/lib/formatDailyForecastDate.ts": "Formats an ISO date into a localized short weekday‑month‑day string using Intl.DateTimeFormat.",
  "frontend/src/lib/imminentWeatherAlerts.ts": "Analyzes the next hour of weather data to generate imminent rain, snow, storm, or fog alerts with severity levels.",
  "frontend/src/lib/laundryDrying.ts": "Calculates hourly drying scores, classifies conditions, and finds optimal drying time ranges using humidity, temperature, wind, and precipitation.",
  "frontend/src/lib/openMeteo.ts": "Fetches and normalizes weather data from Open‑Meteo APIs into a unified WeatherData or WeatherResponse format.",
  "frontend/src/lib/openMeteoMarine.ts": "Fetches marine conditions and complementary weather data, combining wave, wind, and visibility info with fallback estimation.",
  "frontend/src/lib/radarNowcastSummary.ts": "Generates a simple radar precipitation summary estimating start time, duration, intensity, and direction from radar frames.",
  "frontend/src/lib/radarOverlays.ts": "Computes display parameters for various radar overlay types and includes helpers for temperature colors and intensity.",
  "frontend/src/lib/rainviewer.ts": "Parses, normalizes, and filters RainViewer radar data and determines initial playback frame.",
  "frontend/src/lib/rainviewerCache.ts": "Handles caching, validating, and normalizing RainViewer data in sessionStorage.",
  "frontend/src/lib/routeAnalysis.ts": "Analyzes weather conditions along a route to compute risk factors and an overall risk level.",
  "frontend/src/lib/tirePressure.ts": "Calculates tire pressure adjustment recommendations based on temperature and vehicle type.",
  "frontend/src/lib/weatherContrast.ts": "Determines if a weather theme should use a dark background.",
  "frontend/src/lib/weatherTheme.ts": "Maps weather codes to themes, icons, and translation keys for descriptions.",
  "frontend/src/lib/widgetWeatherPayload.ts": "Builds backend-compatible weather payloads and generates stable publish keys for locations.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider.",
  "frontend/src/types/androidBridge.d.ts": "Declares the Android bridge interface for showing notifications.",
  "frontend/src/vite-env.d.ts": "Includes Vite-specific TypeScript definitions.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, custom fonts, color tokens, container settings, and extended theme utilities.",
  "frontend/tsconfig.node.json": "Sets TypeScript options for Vite’s Node config, enabling ESNext modules and composite builds.",
  "frontend/vite.config.ts": "Defines Vite config with React plugin, path aliasing, a dev server proxy to /api, and build output settings.",
  "project_state.json": "Describes the project’s state, including radar forecast requirements, known issues, and pending feature requests."
}