{
  "backend/main.mo": "Minimal backend actor containing no logic; notes that marine and beach data are handled client‑side.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend components, hooks, libraries, and styles.",
  "frontend/index.css": "Global Tailwind CSS setup defining light/dark design tokens and applying shared background and border styles.",
  "frontend/index.html": "Base HTML document setting the WeatherVerse title and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main app container managing location, weather data, alerts, theming, navigation, and layout structure.",
  "frontend/src/components/BackgroundIllustration.tsx": "Displays weather‑themed background images with smooth transitions and contrast‑aware gradient overlays.",
  "frontend/src/components/BeachMarineScreen.tsx": "Marine and beach conditions screen with loading, error, empty states, and detailed cards for wave and temperature data.",
  "frontend/src/components/BottomNav.tsx": "Renders a bottom navigation bar with five tabs and dynamic styling based on the active tab.",
  "frontend/src/components/DriverWeatherPanel.tsx": "Displays driver-focused weather advisories, route analysis, and loading/error states using various computed risk indicators.",
  "frontend/src/components/FarmerGardenWeatherPanel.tsx": "Shows farming and gardening weather advisories including frost, soil moisture, precipitation, planting, and spraying guidance.",
  "frontend/src/components/FloatingAutocompleteDropdown.tsx": "Provides a floating dropdown positioned relative to an anchor element with dynamic sizing and outside-click dismissal.",
  "frontend/src/components/ImminentWeatherAlertBanner.tsx": "Displays a dismissible banner for imminent weather alerts with icons, severity styling, and translated text.",
  "frontend/src/components/InitialRenderErrorBoundary.tsx": "Implements an error boundary that catches initial render failures and shows a recovery UI with optional error details.",
  "frontend/src/components/LaundryDryingRecommendation.tsx": "Presents recommended laundry drying time ranges based on weather data, highlighting best and additional valid periods.",
  "frontend/src/components/LocationSearch.tsx": "Search component providing geocoded location lookup with autocomplete and current-location display.",
  "frontend/src/components/radar/RadarAlertBanner.tsx": "Banner displaying active radar alerts with severity styling and dismiss control.",
  "frontend/src/components/radar/RadarAlertControls.tsx": "Settings UI for enabling radar alerts and adjusting alert radius within a sheet.",
  "frontend/src/components/radar/RadarEmptyState.tsx": "Placeholder UI shown when no location is selected for radar viewing.",
  "frontend/src/components/radar/RadarInfoPanel.tsx": "Panel summarizing radar start time, duration, intensity, and direction for the current frame.",
  "frontend/src/components/radar/RadarLayerToggles.tsx": "UI sheet for toggling radar overlay layers and emitting updated layer sets.",
  "frontend/src/components/radar/RadarMap.tsx": "Initializes and updates a Leaflet map with location markers and dynamic radar/overlay layers.",
  "frontend/src/components/radar/RadarOverlayStatus.tsx": "Displays loading, error, or no‑data status messages for non‑precipitation radar overlays.",
  "frontend/src/components/radar/RadarPlaybackControls.tsx": "Provides timeline slider and playback buttons for navigating radar frames.",
  "frontend/src/components/RadarScreen.tsx": "Main radar view composing location search, radar map, playback, overlays, alerts, and loading/error states.",
  "frontend/src/components/RouteLocationSearch.tsx": "Lightweight location search for routes with autocomplete and selectable/clearable results.",
  "frontend/src/components/ThemeProvider.tsx": "Provides weather-based theme context and applies dark/light UI classes based on theme.",
  "frontend/src/components/WeatherPanel.tsx": "Displays current weather, details, advisories, and loading/error states for a selected location.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useGeocodingSearch.ts": "Debounced geocoding search hook that fetches location results and tracks loading/error state.",
  "frontend/src/hooks/useImminentWeatherAlerts.ts": "Evaluates imminent weather alerts, manages dismiss state, and triggers optional Android bridge notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and managing login/logout flows.",
  "frontend/src/hooks/useMarineConditions.ts": "Fetches and caches marine condition data for given coordinates using react‑query.",
  "frontend/src/hooks/usePersistedLocation.ts": "Manages a saved location in localStorage with load, update, and clear helpers.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that query hooks are implemented elsewhere.",
  "frontend/src/hooks/useRadarAlerts.ts": "Generates and manages radar-based severe weather alerts using session-stored settings.",
  "frontend/src/hooks/useRadarOverlayData.ts": "Fetches weather, air quality, and temperature grid data for radar overlay display.",
  "frontend/src/hooks/useRadarPlayback.ts": "Controls radar animation playback, frame indexing, and labeling.",
  "frontend/src/hooks/useRainViewer.ts": "Fetches and caches RainViewer radar data keyed to the user's location.",
  "frontend/src/hooks/useRouteWeatherAnalysis.ts": "Interpolates route points, fetches weather for each, and returns a route weather analysis.",
  "frontend/src/hooks/useSessionState.ts": "Syncs React state with sessionStorage under a given key.",
  "frontend/src/hooks/useWeather.ts": "Fetches Open-Meteo weather data and transforms it into current, hourly, and daily formats.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides locale state and translation lookup with persistence in localStorage.",
  "frontend/src/i18n/translations.ts": "Contains translation dictionaries for Turkish and English UI strings.",
  "frontend/src/i18n/useI18n.ts": "Returns the i18n context for accessing locale and translations.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive theme variables for light, dark, and weather‑based color schemes plus glass surface utility styles.",
  "frontend/src/lib/clothingAdvisories.ts": "Generates simple clothing recommendations based on temperature, precipitation, and wind using threshold rules.",
  "frontend/src/lib/driverAdvisories.ts": "Calculates road‑ice and fog warnings from temperature, humidity, cloud cover, and precipitation forecasts.",
  "frontend/src/lib/farmerAdvisories.ts": "Provides agricultural advisories including frost, soil moisture, precipitation, planting, and spraying based on hourly forecast data.",
  "frontend/src/lib/formatDailyForecastDate.ts": "Formats ISO dates into localized short weekday and month strings for daily forecasts.",
  "frontend/src/lib/imminentWeatherAlerts.ts": "Detects imminent severe weather in the next hour such as storms, snow, rain, or fog based on weather codes and humidity.",
  "frontend/src/lib/laundryDrying.ts": "Computes drying scores and recommendations for laundry using temperature, humidity, wind, and precipitation over the next 24 hours.",
  "frontend/src/lib/openMeteo.ts": "Defines weather data interfaces and functions to fetch and normalize weather and geocoding data from Open‑Meteo APIs.",
  "frontend/src/lib/openMeteoMarine.ts": "Fetches marine and supplemental weather data, computes derived visibility, and returns consolidated marine conditions.",
  "frontend/src/lib/radarNowcastSummary.ts": "Generates a short radar nowcast summary including start time, duration, estimated intensity, and direction.",
  "frontend/src/lib/radarOverlays.ts": "Computes display parameters for various radar overlay types, including storm, snow, wind, temperature, and air quality.",
  "frontend/src/lib/rainviewer.ts": "Fetches RainViewer radar map data and merges past and nowcast frames into a unified structure.",
  "frontend/src/lib/rainviewerCache.ts": "Implements session‑based caching for RainViewer data with a 5‑minute expiration.",
  "frontend/src/lib/routeAnalysis.ts": "Analyzes weather data along a route to assess risks such as freezing, fog, precipitation, and wind, producing an overall risk rating.",
  "frontend/src/lib/tirePressure.ts": "Calculates tire pressure adjustments based on temperature and vehicle type and returns recommendation metadata.",
  "frontend/src/lib/weatherContrast.ts": "Determines whether a weather theme should be displayed with a dark background.",
  "frontend/src/lib/weatherTheme.ts": "Maps weather codes to themes, icons, and translation keys for weather descriptions.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider context.",
  "frontend/src/types/androidBridge.d.ts": "Declares the Android bridge interface for showing notifications on Android WebView.",
  "frontend/tailwind.config.js": "Tailwind config defining content paths, dark mode, container settings, extended fonts, colors, and radius tokens using CSS variables and plugins.",
  "project_state.json": "Tracks project metadata for WeatherVerse including features, new requests, architecture notes, and versioned project state."
}