{
  "backend/main.mo": "Empty backend actor with a note clarifying that all marine/beach data fetching is handled client‑side.",
  "feature_evidence.json": "Feature evidence report listing UI transparency updates, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and UI/theme changes of various frontend files.",
  "frontend/index.css": "Root CSS variables and Tailwind base styles defining color tokens, dark mode values, and global element styling.",
  "frontend/index.html": "Basic HTML shell initializing the app root and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Main application component handling tab routing, location persistence, weather fetching, theming, and layout structure including the header and language switcher.",
  "frontend/src/components/BackgroundIllustration.tsx": "Displays weather‑themed background images with smooth transitions and overlay gradients while keeping image logic unchanged.",
  "frontend/src/components/BeachMarineScreen.tsx": "Renders marine conditions with loading, error, and empty states using glass‑surface cards and detailed sea/weather metrics.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar switching between weather, farmer, driver, radar, and beach tabs with reactive button styling.",
  "frontend/src/components/DriverWeatherPanel.tsx": "Displays driver-focused weather advisories including ice risk, fog, tire pressure, and route analysis with loading and error states.",
  "frontend/src/components/FarmerGardenWeatherPanel.tsx": "Shows farming and gardening advisories such as frost, soil moisture, precipitation, planting, and spraying with loading and error handling.",
  "frontend/src/components/InitialRenderErrorBoundary.tsx": "A React error boundary that catches initial render failures and shows a refresh prompt with optional technical details.",
  "frontend/src/components/LaundryDryingRecommendation.tsx": "Provides recommended laundry drying time windows based on weather data, with fallback when no good times are available.",
  "frontend/src/components/LocationSearch.tsx": "Searches for and selects locations via geocoding, showing current location info and a dropdown of results with loading states.",
  "frontend/src/components/radar/RadarAlertBanner.tsx": "Shows a dismissible radar alert banner with severity‑based styling and translated text.",
  "frontend/src/components/radar/RadarAlertControls.tsx": "Side sheet for enabling radar alerts and adjusting radius settings via switches and sliders.",
  "frontend/src/components/radar/RadarEmptyState.tsx": "Displays a placeholder message when no radar data is available.",
  "frontend/src/components/radar/RadarInfoPanel.tsx": "Shows radar summary info such as start time, duration, intensity, and direction for the current frame.",
  "frontend/src/components/radar/RadarLayerToggles.tsx": "Sheet UI for toggling radar overlay layers on and off.",
  "frontend/src/components/radar/RadarMap.tsx": "Initializes and manages a Leaflet map, updating markers and radar/overlay layers based on props.",
  "frontend/src/components/radar/RadarOverlayStatus.tsx": "Displays loading, error, or no‑data messages for non‑precipitation radar overlay layers.",
  "frontend/src/components/radar/RadarPlaybackControls.tsx": "UI component providing timeline slider and playback controls for radar frames.",
  "frontend/src/components/RadarScreen.tsx": "Main radar interface combining location search, radar map, playback, overlays, and alert systems with loading and error states.",
  "frontend/src/components/RouteLocationSearch.tsx": "Search input component that queries geocoding results and lets users select or clear a location with a dropdown UI.",
  "frontend/src/components/ThemeProvider.tsx": "Provides a weather‑theme context and wraps children in a light or dark container based on theme rules.",
  "frontend/src/components/WeatherPanel.tsx": "Displays current weather, details, advisories, and loading/error states for a saved location.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useGeocodingSearch.ts": "Debounced geocoding search hook that fetches location suggestions and handles loading and errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identity loading, and authentication state.",
  "frontend/src/hooks/useMarineConditions.ts": "Fetches marine conditions from Open-Meteo Marine API for given coordinates using React Query.",
  "frontend/src/hooks/usePersistedLocation.ts": "Manages a saved location in localStorage, providing load, set, and clear helpers.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that queries are defined in feature-specific hooks.",
  "frontend/src/hooks/useRadarAlerts.ts": "Generates severe weather alerts based on radar data and user settings, with support for dismissing alerts.",
  "frontend/src/hooks/useRadarOverlayData.ts": "Fetches weather, air quality, and temperature grid data for radar overlays using multiple Open‑Meteo APIs.",
  "frontend/src/hooks/useRadarPlayback.ts": "Handles radar frame playback state including autoplay, frame navigation, and frame labeling.",
  "frontend/src/hooks/useRainViewer.ts": "Fetches and caches RainViewer radar data for a location with periodic refetching.",
  "frontend/src/hooks/useRouteWeatherAnalysis.ts": "Fetches weather at interpolated route points and returns an analyzed route weather summary using React Query.",
  "frontend/src/hooks/useSessionState.ts": "Custom hook that syncs React state with sessionStorage for persistence across page reloads.",
  "frontend/src/hooks/useWeather.ts": "Fetches and transforms weather data for a given location using React Query, providing current, hourly, and daily forecasts.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides locale state, translation lookup, and persistence via localStorage for the app's i18n system.",
  "frontend/src/i18n/translations.ts": "Defines Turkish and English translation keys and text used throughout the UI.",
  "frontend/src/i18n/useI18n.ts": "Custom hook to access the i18n context, exposing translation utilities and locale state.",
  "frontend/src/index.css": "Tailwind-based global styles defining color themes, weather-themed variants, and glass-surface utility classes.",
  "frontend/src/lib/clothingAdvisories.ts": "Generates clothing recommendations based on current temperature, precipitation, and wind conditions.",
  "frontend/src/lib/driverAdvisories.ts": "Calculates ice and fog risk levels for drivers using temperature, precipitation, humidity, and weather codes.",
  "frontend/src/lib/farmerAdvisories.ts": "Defines advisory types and computes frost, soil moisture, precipitation, planting, and spraying recommendations from hourly weather data.",
  "frontend/src/lib/formatDailyForecastDate.ts": "Formats an ISO date into a localized short weekday-month-day string for en or tr locales.",
  "frontend/src/lib/laundryDrying.ts": "Computes hourly drying scores and classifications based on weather conditions and generates drying recommendations for the next 24 hours.",
  "frontend/src/lib/openMeteo.ts": "Defines weather data types and fetches current, hourly, and daily weather from the Open-Meteo API, plus location search support.",
  "frontend/src/lib/openMeteoMarine.ts": "Fetches marine conditions and supplemental weather data, deriving wave, wind, visibility, and estimated sea surface temperature values.",
  "frontend/src/lib/radarNowcastSummary.ts": "Generates a simple radar precipitation summary including start time, duration, intensity, and direction from RainViewer frames.",
  "frontend/src/lib/radarOverlays.ts": "Computes display parameters for various radar overlay types including storm, snow, wind, temperature, and air quality layers.",
  "frontend/src/lib/rainviewer.ts": "Fetches RainViewer radar frames and merges past and nowcast data into a unified structure.",
  "frontend/src/lib/rainviewerCache.ts": "Implements sessionStorage caching for RainViewer data with a 5‑minute expiration.",
  "frontend/src/lib/routeAnalysis.ts": "Analyzes weather data to score route risks across freezing, fog, precipitation, and wind and returns an overall risk rating with factor details.",
  "frontend/src/lib/tirePressure.ts": "Computes tire pressure adjustments based on temperature and vehicle type and returns a recommendation with a translation key.",
  "frontend/src/lib/weatherContrast.ts": "Provides a helper to determine if a weather theme should use a dark background.",
  "frontend/src/lib/weatherTheme.ts": "Maps weather codes to themes, icons, and description keys for UI display.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity context providers.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, and plugins for the project.",
  "project_state.json": "Describes project state and features focused on applying consistent 30% opacity glass surfaces across all UI panels."
}