{
  "backend/main.mo": "Motoko actor defining weather types and simple query methods returning fixed weather, daily, and weekly forecast data.",
  "backend/migration.mo": "Migration module initializing new actor state with an empty oracle cache and zeroed timestamp.",
  "feature_evidence.json": "Feature evidence report linking the weather publishing feature to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the roles of various frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind‑based global styles defining light/dark theme CSS variables and shared utility classes.",
  "frontend/index.html": "Base HTML file mounting the React application and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling location persistence, weather fetching, alerts, theme selection, and backend publishing of widget weather data.",
  "frontend/src/components/BackgroundIllustration.tsx": "Component displaying themed background images with fade transitions and contrast‑adjusted overlays.",
  "frontend/src/components/BeachMarineScreen.tsx": "UI screen showing marine conditions with loading, error, and empty states driven by location‑based marine data.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with five tabs and icon buttons, using i18n labels and active-state styling.",
  "frontend/src/components/DriverWeatherPanel.tsx": "Displays driver-focused weather advisories, route analysis, and loading/error states based on weather data.",
  "frontend/src/components/FarmerGardenWeatherPanel.tsx": "Shows multiple farming-related weather advisories with loading/error handling and location header.",
  "frontend/src/components/FloatingAutocompleteDropdown.tsx": "A portal-based floating dropdown that positions itself relative to an anchor and closes on outside click.",
  "frontend/src/components/ImminentWeatherAlertBanner.tsx": "Visual banner for imminent weather alerts with severity-based styling, icons, and dismiss support.",
  "frontend/src/components/InitialRenderErrorBoundary.tsx": "Error boundary that catches initial render failures and shows a fallback UI with refresh and details.",
  "frontend/src/components/LanguageDropdownOverlay.tsx": "Floating language-selection dropdown that positions near a trigger button and updates locale on selection.",
  "frontend/src/components/LaundryDryingRecommendation.tsx": "Displays best and alternative laundry drying time ranges based on weather data, or a fallback message when no good times exist.",
  "frontend/src/components/LocationSearch.tsx": "Provides a searchable geocoding input with autocomplete and shows or clears the currently selected location.",
  "frontend/src/components/radar/RadarAlertBanner.tsx": "Shows an active radar alert with severity‑based styling and a dismiss button.",
  "frontend/src/components/radar/RadarAlertControls.tsx": "Provides UI to enable radar alerts and adjust alert radius via a slide‑out sheet.",
  "frontend/src/components/radar/RadarEmptyState.tsx": "Displays a centered empty-state message for the radar view using translated strings and an icon.",
  "frontend/src/components/radar/RadarInfoPanel.tsx": "Shows a summary of radar data including start time, duration, intensity, and direction using computed nowcast info.",
  "frontend/src/components/radar/RadarLayerToggles.tsx": "Provides a side sheet with switches to enable or disable various radar overlay layers.",
  "frontend/src/components/radar/RadarMap.tsx": "Initializes and manages a Leaflet map with location markers and dynamic radar/overlay layers based on props.",
  "frontend/src/components/radar/RadarOverlayStatus.tsx": "Displays loading, error, or no‑data status messages for non‑precipitation radar overlay layers.",
  "frontend/src/components/radar/RadarPlaybackControls.tsx": "Renders timeline slider and playback controls for navigating radar animation frames.",
  "frontend/src/components/RadarScreen.tsx": "Combines location search, radar map, playback, layers, and alerts to render a full radar viewing interface.",
  "frontend/src/components/RouteLocationSearch.tsx": "Offers a compact geocoding search and selection UI for route endpoints with autocomplete and clear actions.",
  "frontend/src/components/ThemeProvider.tsx": "Supplies weather‑based theme context and applies a dark or light mode wrapper.",
  "frontend/src/components/WeatherPanel.tsx": "Renders current weather details, advisories, and laundry recommendations with loading and error states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useGeocodingSearch.ts": "Debounces a search query and fetches geocoding results using React Query.",
  "frontend/src/hooks/useImminentWeatherAlerts.ts": "Evaluates imminent weather alerts, handles dismissal cooldowns, and optionally triggers Android bridge notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useMarineConditions.ts": "Uses React Query to fetch marine weather data from Open-Meteo based on given coordinates with timed refresh.",
  "frontend/src/hooks/usePersistedLocation.ts": "Manages a saved location in localStorage with load, update, and clear helpers.",
  "frontend/src/hooks/usePublishWidgetWeather.ts": "Defines a mutation to publish weather data to the backend actor for Android widget support, with error logging.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that data-fetching hooks are implemented elsewhere.",
  "frontend/src/hooks/useRadarAlerts.ts": "Tracks radar alert settings and generates simple severe weather alerts based on radar playback frames.",
  "frontend/src/hooks/useRadarOverlayData.ts": "Fetches weather, air quality, and temperature grid data to provide overlay info for radar views.",
  "frontend/src/hooks/useRadarPlayback.ts": "Manages radar frame playback with controls for play, pause, frame selection, and time labeling.",
  "frontend/src/hooks/useRainViewer.ts": "Fetches and caches RainViewer radar data using React Query with periodic refresh.",
  "frontend/src/hooks/useRouteWeatherAnalysis.ts": "Computes weather analysis along a route by interpolating points, fetching weather for each, and running analysis.",
  "frontend/src/hooks/useSessionState.ts": "Provides sessionStorage-backed React state with automatic load and save behavior.",
  "frontend/src/hooks/useWeather.ts": "Fetches and transforms weather and air quality data, computes pressure trend, and exposes it via a React Query hook.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides locale state, translation lookup, and persistence via context and localStorage.",
  "frontend/src/i18n/translations.ts": "Defines Turkish translation strings for UI labels, weather terms, and advisories.",
  "frontend/src/i18n/useI18n.ts": "Hook that retrieves the i18n context and throws if used outside the provider.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, weather‑based color variants, and glass UI utilities.",
  "frontend/src/lib/clothingAdvisories.ts": "Generates clothing suggestions based on temperature, precipitation, and wind using weather data.",
  "frontend/src/lib/driverAdvisories.ts": "Calculates road ice and fog warnings using current and near‑term weather conditions.",
  "frontend/src/lib/farmerAdvisories.ts": "Computes farming advisories such as frost, soil moisture, precipitation, planting, and spraying guidance from hourly data.",
  "frontend/src/lib/fetchWithTimeout.ts": "Provides a fetch wrapper that cancels requests after a timeout and throws a user-friendly error on abort.",
  "frontend/src/lib/formatDailyForecastDate.ts": "Formats an ISO date into a localized short weekday-month-day string based on the app locale.",
  "frontend/src/lib/imminentWeatherAlerts.ts": "Analyzes the next hour of weather data to detect imminent rain, snow, storm, or fog and returns a structured alert.",
  "frontend/src/lib/laundryDrying.ts": "Computes hourly drying scores from weather data, classifies them, and derives optimal time ranges for drying laundry.",
  "frontend/src/lib/openMeteo.ts": "Fetches and normalizes weather data from the Open-Meteo API using a timeout-enabled fetch wrapper.",
  "frontend/src/lib/openMeteoMarine.ts": "Retrieves marine and forecast data to produce combined sea and wind conditions, deriving visibility when missing.",
  "frontend/src/lib/radarNowcastSummary.ts": "Generates a simple radar precipitation summary including start time, duration, intensity, and direction.",
  "frontend/src/lib/radarOverlays.ts": "Maps radar overlay types to display parameters for storm, snow, wind, temperature, and air quality layers.",
  "frontend/src/lib/rainviewer.ts": "Fetches RainViewer radar frames, preserves past and nowcast data, and provides utilities for playback frame selection.",
  "frontend/src/lib/rainviewerCache.ts": "Manages sessionStorage-based caching of RainViewerData with a 5‑minute expiry.",
  "frontend/src/lib/routeAnalysis.ts": "Analyzes weather data along a route to produce risk level, summary key, and contributing factors.",
  "frontend/src/lib/tirePressure.ts": "Computes tire pressure adjustments based on temperature and vehicle type with translation keys.",
  "frontend/src/lib/weatherContrast.ts": "Returns whether a weather theme should use a dark background.",
  "frontend/src/lib/weatherTheme.ts": "Maps weather codes to themes, icons, and translation description keys.",
  "frontend/src/lib/widgetWeatherPayload.ts": "Generates stable publish keys and converts WeatherData into backend-compatible WeatherResponse payloads.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/types/androidBridge.d.ts": "Declares Android bridge interface for triggering native notifications.",
  "frontend/src/vite-env.d.ts": "Provides Vite type definitions for the project.",
  "frontend/tailwind.config.js": "Configures TailwindCSS themes, colors, fonts, and plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-specific Vite build files.",
  "frontend/vite.config.ts": "Configures Vite with React plugin, path aliases, dev server, and build settings.",
  "project_state.json": "Stores current project state, feature requests, and architectural notes for WeatherVerse."
}