{
  "backend/main.mo": "Motoko actor defining weather data types (WeatherResponse, WeeklyForecast, DBWeather) and query functions (getWeather, getWeeklyForecast, getDailyForecast, getCurrentWeather) that return hardcoded mock weather data with temperature, conditions, precipitation, and wind information.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features for adding a Radar tab to bottom navigation, creating RadarScreen component, integrating RadarMap with weather API data, and wiring up the Radar tab in App.tsx.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including App.tsx (main component with tab navigation), hooks for weather/location/geocoding, theme providers, weather panels, translation system, and utility libraries for Open-Meteo API integration and weather theme mapping.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark themes, including custom properties for background, foreground, primary, secondary, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, WeatherVerse title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component managing location state, active tab navigation (weather/farmer/driver/radar/beach), weather data fetching, imminent alerts, backend publishing, theme provider, and rendering LocationSearch, weather panels, BottomNav, and BackgroundIllustration components.",
  "frontend/src/components/BackgroundIllustration.tsx": "Component rendering weather-themed background images (clear/cloudy/rain/snow) with smooth transitions and gradient overlays that adjust opacity based on dark/light theme using isDarkWeatherTheme utility.",
  "frontend/src/components/BeachMarineScreen.tsx": "Beach/marine conditions screen displaying wave height, wave period, water temperature, wind speed, and visibility using useMarineConditions hook with responsive grid layout and glass-surface styling.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar component with five tabs (weather, farmer, driver, radar, beach) using icons and internationalized labels, with active state styling and responsive design.",
  "frontend/src/components/DriverWeatherPanel.tsx": "Driver-focused weather panel displaying road ice risk, fog warnings, and route weather analysis with location search functionality. Shows loading, error, and empty states with responsive layout.",
  "frontend/src/components/FarmerGardenWeatherPanel.tsx": "Agricultural weather panel displaying humidity, temperature, and farming-relevant weather insights with responsive grid layout and loading/error states.",
  "frontend/src/components/FloatingAutocompleteDropdown.tsx": "Portal-based floating dropdown component that positions itself relative to an anchor element, handles viewport flipping, and manages click-outside behavior for autocomplete functionality.",
  "frontend/src/components/ImminentWeatherAlertBanner.tsx": "Alert banner component displaying imminent weather warnings (rain, snow, storm, fog) with severity-based styling, icons, and dismissible functionality.",
  "frontend/src/components/InitialRenderErrorBoundary.tsx": "React error boundary component that catches initial render errors and displays a fallback UI with error details and a refresh button.",
  "frontend/src/components/LanguageDropdownOverlay.tsx": "Language switcher dropdown overlay component using portal rendering, supporting Turkish and English locales with positioning logic and click-outside handling.",
  "frontend/src/components/LaundryDryingRecommendation.tsx": "Component displaying optimal laundry drying time recommendations based on weather data, showing best time ranges and alternative periods with conditional rendering.",
  "frontend/src/components/LocationSearch.tsx": "A location search component with autocomplete dropdown that allows users to search for locations using geocoding, displays the currently selected location with admin/country info, and provides clear functionality.",
  "frontend/src/components/radar/RadarAlertBanner.tsx": "Alert banner component that displays radar alerts with severity-based styling (destructive for severe), showing title, message, and dismiss button.",
  "frontend/src/components/radar/RadarAlertControls.tsx": "Sheet-based settings panel for radar alerts with enable/disable toggle and radius slider (5-20km) for configuring alert detection area.",
  "frontend/src/components/radar/RadarEmptyState.tsx": "Empty state component displayed when no location is selected for radar view, showing a cloud icon and instructional text.",
  "frontend/src/components/radar/RadarForecastLabel.tsx": "Floating label overlay that appears on radar map to indicate forecast data uncertainty with warning styling and icon.",
  "frontend/src/components/radar/RadarFrameModeToggle.tsx": "Toggle group component for switching between forecast and past radar frame modes, with icons and responsive text labels.",
  "frontend/src/components/radar/RadarInfoPanel.tsx": "Displays a grid of radar summary information (start time, duration, intensity, direction) using icons and translated labels. Computes summary from radar data and current frame index.",
  "frontend/src/components/radar/RadarLayerToggles.tsx": "Provides a sheet/drawer UI with toggles for enabling/disabling radar layers (precipitation, storm, snow, wind, temperature, airQuality). Uses a Set to track enabled layers.",
  "frontend/src/components/radar/RadarMap.tsx": "Renders an interactive Leaflet map with location marker, dynamically loads precipitation radar tiles and weather overlay layers (temperature, wind, storm, snow, air quality) based on enabled layers. Manages custom panes for layer z-index ordering.",
  "frontend/src/components/radar/RadarOverlayStatus.tsx": "Displays loading, error, or informational alerts for radar overlay data (excluding precipitation). Shows specific messages when storm, snow, or air quality data is unavailable.",
  "frontend/src/components/radar/RadarPlaybackControls.tsx": "Provides play/pause, skip, and timeline slider controls for radar frame playback. Displays current frame index, total frames, and timestamp.",
  "frontend/src/components/RadarScreen.tsx": "Main radar screen component that orchestrates radar visualization with playback controls, layer toggles, alert system, and forecast/past mode switching. Integrates RainViewer data, overlay data, and displays empty state when no location is selected.",
  "frontend/src/components/RouteLocationSearch.tsx": "A labeled location search component similar to LocationSearch but designed for route planning, accepting a label prop and using GeocodingResult type instead of SavedLocation.",
  "frontend/src/components/ThemeProvider.tsx": "Context provider that manages weather-based theming (clear, cloudy, rain, snow) and applies dark mode class based on weather conditions using isDarkWeatherTheme utility.",
  "frontend/src/components/WeatherPanel.tsx": "Displays current weather conditions including temperature, weather description, humidity, wind, visibility, pressure, UV index, and AQI. Shows loading, error, and empty states, and includes LaundryDryingRecommendation component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor based on Internet Identity. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useGeocodingSearch.ts": "Debounces user input and queries the Open-Meteo geocoding API for location search results. Returns results, loading state, and errors.",
  "frontend/src/hooks/useImminentWeatherAlerts.ts": "Evaluates weather data for imminent alerts, manages dismissal state with cooldown in sessionStorage, and optionally calls Android WebView bridge to show native notifications for new alerts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMarineConditions.ts": "React Query hook that fetches marine/beach conditions from Open-Meteo Marine API for given coordinates with 5-minute stale time and 10-minute refetch interval.",
  "frontend/src/hooks/usePersistedLocation.ts": "Hook for managing user's saved location in localStorage, providing get/set/clear operations for location data including name, coordinates, and administrative regions.",
  "frontend/src/hooks/usePublishWidgetWeather.ts": "Mutation hook that publishes weather data to the backend canister for Android widget consumption via HTTP endpoint, with graceful error handling.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file documenting that all data fetching is done client-side from Open-Meteo APIs (weather, marine, air quality) and RainViewer, with no backend queries currently used.",
  "frontend/src/hooks/useRadarAlerts.ts": "Manages radar-based precipitation alerts with configurable radius and severity detection, tracking dismissed alerts and providing alert settings persistence via session storage.",
  "frontend/src/hooks/useRadarOverlayData.ts": "Fetches weather overlay data (temperature, wind, precipitation, air quality) from Open-Meteo APIs for radar display, including temperature grid heatmap sampling around the location.",
  "frontend/src/hooks/useRadarPlayback.ts": "Controls radar animation playback with play/pause/seek functionality, auto-looping through frames at 500ms intervals, and frame label formatting.",
  "frontend/src/hooks/useRainViewer.ts": "Fetches and caches RainViewer radar data from backend-cached endpoint, validating data structure and refreshing every 5 minutes with local cache fallback.",
  "frontend/src/hooks/useRouteWeatherAnalysis.ts": "Analyzes weather conditions along a route by interpolating points between start and end locations, fetching weather for each point, and generating route-wide weather analysis.",
  "frontend/src/hooks/useSessionState.ts": "Custom hook providing sessionStorage-backed state management with JSON serialization, automatic persistence on state changes, and error handling.",
  "frontend/src/hooks/useWeather.ts": "React Query hook that fetches weather and air quality data from Open-Meteo API, transforms it into a structured WeatherData format with current, hourly (48h), and daily (7d) forecasts, and calculates pressure trends.",
  "frontend/src/i18n/I18nProvider.tsx": "React context provider for internationalization that manages locale state (Turkish/English) in localStorage and provides a translation function to child components.",
  "frontend/src/i18n/translations.ts": "Translation dictionary containing Turkish and English strings for all UI elements including weather conditions, navigation, advisories, and status messages.",
  "frontend/src/i18n/useI18n.ts": "Custom React hook that provides access to the I18nContext for locale management and translation functions.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light/dark themes, weather-specific themes (rain/snow/clear/cloudy), and glass-morphism utility classes.",
  "frontend/src/lib/clothingAdvisories.ts": "Analyzes current and near-term (3h) weather data to generate clothing recommendations based on temperature, wind speed, and precipitation thresholds.",
  "frontend/src/lib/driverAdvisories.ts": "Calculates road safety advisories for drivers including road ice risk (based on temperature and precipitation) and fog warnings (based on humidity, cloud cover, and weather codes).",
  "frontend/src/lib/farmerAdvisories.ts": "Provides agricultural advisories including frost warnings, soil moisture levels, precipitation forecasts, planting conditions, and pesticide spraying safety based on weather data analysis.",
  "frontend/src/lib/fetchWithTimeout.ts": "Utility function that wraps fetch API with AbortController to enforce configurable timeout (default 10s) and handle timeout errors gracefully.",
  "frontend/src/lib/formatDailyForecastDate.ts": "Formats ISO date strings into localized short date formats (e.g., \"Mon, Jan 15\") using Intl.DateTimeFormat for English and Turkish locales.",
  "frontend/src/lib/imminentWeatherAlerts.ts": "Evaluates the next 60 minutes of hourly weather data to detect and return imminent severe weather alerts (storm, snow, rain, fog) with priority-based severity levels.",
  "frontend/src/lib/laundryDrying.ts": "Calculates laundry drying scores and recommendations based on temperature, humidity, wind speed, precipitation, and weather codes, classifying conditions into ideal/suitable/limited/not-suitable categories and identifying optimal time ranges.",
  "frontend/src/lib/openMeteo.ts": "Provides functions to fetch weather data (current, hourly, daily) and geocoding results from the Open-Meteo API with timeout handling.",
  "frontend/src/lib/openMeteoMarine.ts": "Fetches marine conditions (wave height, period, direction, sea surface temperature, wind, visibility) from Open-Meteo Marine and Forecast APIs, with derived visibility estimates from humidity when unavailable.",
  "frontend/src/lib/radarNowcastSummary.ts": "Computes radar nowcast summaries including start time, duration, intensity classification, and direction from RainViewer radar frame data.",
  "frontend/src/lib/radarOverlays.ts": "Provides display parameters (radius, color, opacity) for different radar overlay types (storm, snow, wind, temperature, air quality) based on weather data values.",
  "frontend/src/lib/rainviewer.ts": "Parses and normalizes RainViewer radar data, filtering nowcast frames to 90-minute future limit, and provides utilities to find initial playback frame index.",
  "frontend/src/lib/rainviewerCache.ts": "Manages sessionStorage caching for RainViewer radar data with 5-minute expiration, including validation and normalization logic to handle backward compatibility between old (single frames array) and new (separate past/nowcast arrays) cache formats.",
  "frontend/src/lib/routeAnalysis.ts": "Analyzes weather data across multiple route points to calculate overall risk (safe/caution/danger) based on freezing temperatures, fog, precipitation, and wind conditions, returning localized message keys for each factor.",
  "frontend/src/lib/tirePressure.ts": "Calculates tire pressure recommendations based on ambient temperature and vehicle type (passenger/SUV/commercial), adjusting from a reference temperature of 20°C at 1 PSI per 10°C change.",
  "frontend/src/lib/weatherContrast.ts": "Utility function that determines if a weather theme (clear/cloudy/rain/snow) should be treated as having a dark background, returning true for rain and snow themes.",
  "frontend/src/lib/weatherTheme.ts": "Maps WMO weather codes to visual themes (clear/cloudy/rain/snow), corresponding Lucide icons, and internationalized description keys for weather conditions.",
  "frontend/src/lib/widgetWeatherPayload.ts": "Transforms frontend WeatherData into backend-compatible WeatherResponse format for widget publishing, generating stable location-based keys and mapping WMO codes to condition strings.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/types/androidBridge.d.ts": "TypeScript declaration file defining the Android bridge interface for showing native notifications from the web view.",
  "frontend/src/vite-env.d.ts": "TypeScript reference file for Vite client types.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended animations (pulse-glow), and plugins for animations and typography.",
  "frontend/tsconfig.node.json": "TypeScript configuration for Node.js build scripts (vite.config.ts) with ESNext module resolution.",
  "frontend/vite.config.ts": "Vite build configuration with React plugin, path aliases, dev server on port 3000 with API proxy to localhost:4943, and dist output directory.",
  "project_state.json": "Project state tracking document showing WeatherVerse app with completed Radar tab features (navigation, RadarScreen component, RadarMap integration) and pending internationalization strings for the Radar tab label."
}