{
  "backend/main.mo": "Defines weather-related types and provides query endpoints returning mock daily, weekly, and current weather data with simple caching structure.",
  "backend/migration.mo": "Contains a migration module that initializes a new actor state with an optional rainViewerCache set to null.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requirements to frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Provides human-written summaries describing functionality of major frontend files in the project.",
  "frontend/index.css": "Defines Tailwind base, components, and utilities, plus extensive CSS variable themes for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component managing location, weather fetching, alerts, widget publishing, theming, and tab navigation.",
  "frontend/src/components/BackgroundIllustration.tsx": "Renders themed background images with smooth transitions and light/dark gradient overlays based on weather theme.",
  "frontend/src/components/BeachMarineScreen.tsx": "Displays marine conditions for a selected beach with loading, empty, and error states, showing temperature, waves, and related data.",
  "frontend/src/components/BottomNav.tsx": "Renders a bottom navigation bar with tab buttons for weather, farmer, driver, radar, and beach views.",
  "frontend/src/components/DriverWeatherPanel.tsx": "Shows driver-focused weather advisories, route analysis, and risk assessments with loading and error handling.",
  "frontend/src/components/FarmerGardenWeatherPanel.tsx": "Provides farming-related weather advisories such as frost, soil moisture, precipitation, planting, and spraying conditions.",
  "frontend/src/components/FloatingAutocompleteDropdown.tsx": "Implements a floating dropdown positioned relative to an anchor, with dynamic placement, sizing, and outside-click handling.",
  "frontend/src/components/ImminentWeatherAlertBanner.tsx": "Displays a styled banner for imminent weather alerts with icons, severity styling, and a dismiss button.",
  "frontend/src/components/InitialRenderErrorBoundary.tsx": "Error boundary that catches initial render errors and displays a fallback UI with refresh and technical details.",
  "frontend/src/components/LanguageDropdownOverlay.tsx": "Interactive language selector overlay that positions itself relative to a trigger button and closes on outside click or Escape. Allows switching between Turkish and English via portal-rendered dropdown.",
  "frontend/src/components/LaundryDryingRecommendation.tsx": "Displays optimal laundry drying times based on weather data, showing best and alternative ranges or a warning when none are suitable.",
  "frontend/src/components/LocationSearch.tsx": "Location search input with autocomplete using geocoding results, allowing selection or clearing of the current location. Shows a floating dropdown for search results.",
  "frontend/src/components/radar/RadarAlertBanner.tsx": "Displays a dismissible alert banner for radar warnings with severity-based styling and translated text.",
  "frontend/src/components/radar/RadarAlertControls.tsx": "Provides a side sheet UI to configure alert settings like enable toggle and radius slider.",
  "frontend/src/components/radar/RadarEmptyState.tsx": "Shows an empty state when no radar data is available, using translated title and description.",
  "frontend/src/components/radar/RadarForecastLabel.tsx": "Renders a floating label indicating that the displayed radar data is a short-term forecast.",
  "frontend/src/components/radar/RadarFrameModeToggle.tsx": "Toggle control for switching between forecast and past radar frame modes with translations.",
  "frontend/src/components/radar/RadarInfoPanel.tsx": "Displays computed radar summary info such as start time, duration, intensity, and direction for the current frame.",
  "frontend/src/components/radar/RadarLayerToggles.tsx": "Side sheet UI for enabling or disabling additional radar layers via switches.",
  "frontend/src/components/radar/RadarMap.tsx": "Initializes and manages a Leaflet map with location marker and dynamic radar/overlay layers, updating on location or layer changes.",
  "frontend/src/components/radar/RadarOverlayStatus.tsx": "Shows loading, error, or no-data overlay messages for non-precipitation radar layers based on state and returned overlay data.",
  "frontend/src/components/radar/RadarPlaybackControls.tsx": "Provides playback buttons and a timeline slider for navigating radar frames, with handling for user interaction and disabled states.",
  "frontend/src/components/RadarScreen.tsx": "Main radar UI combining map, playback, overlays, alerts, and location search. Manages radar data fetching, frame playback, and forecast/past mode switching.",
  "frontend/src/components/RouteLocationSearch.tsx": "Autocomplete search component for selecting a route location, supporting clearing, loading states, and error display. Uses floating dropdown results from geocoding search.",
  "frontend/src/components/ThemeProvider.tsx": "Provides a weather‑based theme context and toggles dark mode based on weather conditions. Wraps children with a theme‑annotated container.",
  "frontend/src/components/WeatherPanel.tsx": "Weather overview panel showing current conditions, advisories, AQI/UV categories, and laundry recommendations with loading and error states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useGeocodingSearch.ts": "Performs debounced geocoding searches using React Query, returning results, loading state, and errors.",
  "frontend/src/hooks/useImminentWeatherAlerts.ts": "Manages imminent weather alerts with dismissal cooldowns and optional Android WebView notifications, tracking alert changes and persistence with sessionStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context and hooks for managing Internet Identity login flow using Dfinity AuthClient, including identity loading, login state, and error handling.",
  "frontend/src/hooks/useMarineConditions.ts": "Fetches marine weather data via React Query using Open-Meteo's marine API, with timed refetching and validation of coordinates.",
  "frontend/src/hooks/usePersistedLocation.ts": "Stores and retrieves a saved location from localStorage, exposing methods to set and clear the persisted value.",
  "frontend/src/hooks/usePublishWidgetWeather.ts": "Publishes weather data to the backend via a mutation using an actor, exposing publish state and handling errors without UI disruption.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that backend queries are implemented within feature-specific hooks.",
  "frontend/src/hooks/useRadarAlerts.ts": "Generates simple radar-based severe weather alerts using session-stored settings, detecting heavy precipitation and managing alert dismissal.",
  "frontend/src/hooks/useRadarOverlayData.ts": "Fetches radar overlay weather data, air quality, and temperature grids from Open-Meteo APIs and computes derived storm intensity.",
  "frontend/src/hooks/useRadarPlayback.ts": "Controls radar playback animation with play, pause, seek, and frame label utilities, handling looping and frame resets.",
  "frontend/src/hooks/useRainViewer.ts": "Loads RainViewer radar data via backend actor with caching and validation, falling back to cached data when valid.",
  "frontend/src/hooks/useRouteWeatherAnalysis.ts": "Interpolates route points, fetches weather for each, transforms the data, and returns a route weather analysis via React Query.",
  "frontend/src/hooks/useSessionState.ts": "Custom hook that syncs React state with sessionStorage using a key and default value.",
  "frontend/src/hooks/useWeather.ts": "Fetches weather and air quality data, transforms it into a unified WeatherData object, and exposes it through React Query.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides locale state, persistence, and translation lookup through a React context.",
  "frontend/src/i18n/translations.ts": "Contains Turkish and English translation strings for UI text keys.",
  "frontend/src/i18n/useI18n.ts": "Convenience hook to access the i18n context and translation function.",
  "frontend/src/index.css": "Defines Tailwind setup, theme variables, dark mode, and weather‑themed CSS variants with glass-surface utilities.",
  "frontend/src/lib/clothingAdvisories.ts": "Generates clothing recommendations based on temperature, precipitation, wind, and near‑term weather.",
  "frontend/src/lib/driverAdvisories.ts": "Computes road ice risk and fog warnings from current and hourly weather data.",
  "frontend/src/lib/farmerAdvisories.ts": "Defines advisory interfaces and computes frost, soil moisture, precipitation, planting, and spraying recommendations based on hourly weather data.",
  "frontend/src/lib/fetchWithTimeout.ts": "Provides a fetch wrapper with AbortController that enforces a configurable timeout and throws on request cancellation.",
  "frontend/src/lib/formatDailyForecastDate.ts": "Formats an ISO date into a short, locale‑specific weekday and month string using Intl.DateTimeFormat.",
  "frontend/src/lib/imminentWeatherAlerts.ts": "Analyzes the next hour of weather data to detect imminent rain, snow, storms, or fog and returns a structured alert.",
  "frontend/src/lib/laundryDrying.ts": "Calculates hourly drying scores based on humidity, wind, temperature, and precipitation, and derives recommended drying time ranges.",
  "frontend/src/lib/openMeteo.ts": "Fetches and normalizes weather data from the Open‑Meteo API, providing current, hourly, and daily fields along with soil moisture.",
  "frontend/src/lib/openMeteoMarine.ts": "Fetches marine conditions and supplemental weather data, deriving wave, wind, temperature, and visibility metrics.",
  "frontend/src/lib/radarNowcastSummary.ts": "Generates a radar summary estimating start time, duration, intensity, and direction of precipitation from RainViewer frames.",
  "frontend/src/lib/radarOverlays.ts": "Computes visual parameters for various radar overlay types based on weather data, including storm, snow, wind, temperature, and air quality. Includes helper functions for temperature coloring and intensity.",
  "frontend/src/lib/rainviewer.ts": "Parses and normalizes RainViewer radar data, filters nowcast frames, and determines the initial playback frame. Provides utilities for validating and combining radar frames.",
  "frontend/src/lib/rainviewerCache.ts": "Manages sessionStorage caching for RainViewer data with validation, backward compatibility handling, and expiration logic. Allows reading and writing normalized radar cache entries.",
  "frontend/src/lib/routeAnalysis.ts": "Analyzes a route's weather conditions to compute risk levels based on freezing temps, fog, precipitation, and wind. Returns an overall risk rating with detailed contributing factors.",
  "frontend/src/lib/tirePressure.ts": "Calculates tire pressure adjustments based on temperature and vehicle type using a simple PSI-per-10°C model. Returns an adjustment string and a translation key explaining the recommendation.",
  "frontend/src/lib/weatherContrast.ts": "Determines whether a weather theme should use a dark background, treating rain and snow as dark themes. Simple utility for UI theming.",
  "frontend/src/lib/weatherTheme.ts": "Maps WMO weather codes to themes, icons, and translation keys for descriptions. Provides utilities for determining weather visuals and labels.",
  "frontend/src/lib/widgetWeatherPayload.ts": "Builds backend-compatible widget weather payloads from frontend weather data and generates stable location keys. Converts daily and weekly weather info into a backend-defined response format.",
  "frontend/src/main.tsx": "Initializes the React application with query client and Internet Identity provider, then renders the App component. Imports global styles and mounts the root element.",
  "frontend/src/types/androidBridge.d.ts": "Declares the Android bridge interface on the Window object for invoking native notifications. Provides TypeScript typings for optional Android integration.",
  "frontend/src/vite-env.d.ts": "Includes Vite client type definitions for the project environment.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, colors, radii, and plugins for typography, container queries, and animations.",
  "frontend/tsconfig.node.json": "Sets Node-specific TypeScript options for Vite, enabling composite builds and ESNext module resolution.",
  "frontend/vite.config.ts": "Defines Vite build setup with React plugin, path aliasing, dev server proxy, and build output settings.",
  "project_state.json": "Stores project metadata, feature requirements, architectural notes, and pending radar-related feature requests."
}