{
  "backend/main.mo": "Empty Motoko actor definition with no implemented methods.",
  "feature_evidence.json": "Feature evidence report mapping radar-related feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing major frontend components, hooks, libraries, and styles.",
  "frontend/index.css": "Tailwind base/style configuration defining light and dark theme CSS variables and applying global background and text styles.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app container managing tabs, location, weather fetching, theming, alerts, and layout structure.",
  "frontend/src/components/BackgroundIllustration.tsx": "Component that displays and transitions weather‑themed background images with dark/light overlay gradients.",
  "frontend/src/components/BeachMarineScreen.tsx": "UI screen showing marine conditions with loading, error, and empty states based on the selected location.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar switching between weather, farmer, driver, radar, and beach tabs.",
  "frontend/src/components/DriverWeatherPanel.tsx": "Displays driver-focused weather risks, route analysis, and status cards with loading and error states.",
  "frontend/src/components/FarmerGardenWeatherPanel.tsx": "Shows agriculture-related weather advisories such as frost, moisture, and planting, with loading and error handling.",
  "frontend/src/components/FloatingAutocompleteDropdown.tsx": "Renders a floating dropdown positioned relative to an anchor element with dynamic sizing and outside-click closing.",
  "frontend/src/components/ImminentWeatherAlertBanner.tsx": "Displays a dismissible banner for imminent weather alerts with severity-based styling and icons.",
  "frontend/src/components/InitialRenderErrorBoundary.tsx": "Error boundary that catches initial render failures and shows a fallback UI with a reload option.",
  "frontend/src/components/LanguageDropdownOverlay.tsx": "Creates a floating language selector dropdown positioned near a trigger button with outside-click handling.",
  "frontend/src/components/LaundryDryingRecommendation.tsx": "Presents recommended laundry drying times based on weather conditions, including best and alternative ranges.",
  "frontend/src/components/LocationSearch.tsx": "Search input with autocomplete for selecting and clearing a SavedLocation, showing current selection and geocoding results.",
  "frontend/src/components/radar/RadarAlertBanner.tsx": "Shows an active radar alert with severity styling and a dismiss button.",
  "frontend/src/components/radar/RadarAlertControls.tsx": "UI sheet for enabling radar alerts and adjusting distance radius settings.",
  "frontend/src/components/radar/RadarEmptyState.tsx": "Empty-state panel prompting the user to select a location before viewing radar data.",
  "frontend/src/components/radar/RadarInfoPanel.tsx": "Displays computed radar summary details like timing, duration, intensity, and storm direction.",
  "frontend/src/components/radar/RadarLayerToggles.tsx": "UI sheet for toggling radar overlay layers using switches and i18n labels.",
  "frontend/src/components/radar/RadarMap.tsx": "Initializes and manages a Leaflet map, updating markers and radar/overlay layers based on location and enabled layers.",
  "frontend/src/components/radar/RadarOverlayStatus.tsx": "Displays loading, error, or no‑data alerts for non‑precipitation radar overlays based on current overlay data.",
  "frontend/src/components/radar/RadarPlaybackControls.tsx": "Provides slider and playback buttons for navigating radar animation frames with i18n labels.",
  "frontend/src/components/RadarScreen.tsx": "Main radar view that handles location selection, radar data fetching, playback, overlays, and alert system UI.",
  "frontend/src/components/RouteLocationSearch.tsx": "Lightweight location search for routes with autocomplete, selection display, and result handling.",
  "frontend/src/components/ThemeProvider.tsx": "Provides weather-based theme context and toggles dark mode based on theme type.",
  "frontend/src/components/WeatherPanel.tsx": "Displays current weather, forecasts, AQI/UV info, and advisories with loading and error states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useGeocodingSearch.ts": "Performs debounced geocoding queries via Open‑Meteo and returns results with loading/error state.",
  "frontend/src/hooks/useImminentWeatherAlerts.ts": "Evaluates imminent weather alerts, manages dismissal persistence, and triggers Android bridge notifications with cooldowns.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, stored identities, and AuthClient initialization.",
  "frontend/src/hooks/useMarineConditions.ts": "Fetches marine weather data for given coordinates with periodic refetching.",
  "frontend/src/hooks/usePersistedLocation.ts": "Loads, stores, and clears the user’s saved location in localStorage.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating query hooks are implemented elsewhere.",
  "frontend/src/hooks/useRadarAlerts.ts": "Manages radar alert settings, detects severe precipitation from radar frames, and handles alert dismissal.",
  "frontend/src/hooks/useRadarOverlayData.ts": "Fetches weather, air quality, and temperature grid data for radar overlays using Open‑Meteo APIs.",
  "frontend/src/hooks/useRadarPlayback.ts": "Controls radar animation playback, frame indexing, and helpers for labeling and identifying frames.",
  "frontend/src/hooks/useRainViewer.ts": "Fetches and caches RainViewer radar data with react‑query.",
  "frontend/src/hooks/useRouteWeatherAnalysis.ts": "Interpolates route points, fetches weather for each, and runs route weather analysis.",
  "frontend/src/hooks/useSessionState.ts": "Persists React state to sessionStorage with automatic serialization.",
  "frontend/src/hooks/useWeather.ts": "Fetches and transforms detailed weather and air quality data for a given location.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides locale state, persistence, and translation lookup to the app.",
  "frontend/src/i18n/translations.ts": "Contains Turkish and English translation strings for UI text.",
  "frontend/src/i18n/useI18n.ts": "Accesses the I18n context and returns translation utilities.",
  "frontend/src/index.css": "Defines base Tailwind layers and extensive CSS variables for themes, dark mode, and weather‑based color variants, plus utility classes like glass surfaces.",
  "frontend/src/lib/clothingAdvisories.ts": "Generates simple clothing recommendations based on temperature, precipitation, and wind using weather thresholds.",
  "frontend/src/lib/driverAdvisories.ts": "Computes road ice and fog risk levels using temperature, humidity, precipitation, and weather codes.",
  "frontend/src/lib/farmerAdvisories.ts": "Provides multiple agriculture‑focused advisories including frost, soil moisture, precipitation, planting, and spraying analyses.",
  "frontend/src/lib/fetchWithTimeout.ts": "Implements a fetch wrapper that aborts requests after a configurable timeout.",
  "frontend/src/lib/formatDailyForecastDate.ts": "Formats ISO dates into short weekday/month/day strings based on locale.",
  "frontend/src/lib/imminentWeatherAlerts.ts": "Detects imminent severe weather within the next hour, returning alerts for storms, snow, rain, or fog.",
  "frontend/src/lib/laundryDrying.ts": "Calculates hourly drying scores and classifications using temperature, humidity, wind, and precipitation to recommend good drying periods.",
  "frontend/src/lib/openMeteo.ts": "Defines weather data interfaces and provides functions to fetch and normalize weather information from the Open-Meteo API.",
  "frontend/src/lib/openMeteoMarine.ts": "Fetches marine and forecast data, deriving wave, wind, and visibility conditions into a unified marine conditions object.",
  "frontend/src/lib/radarNowcastSummary.ts": "Computes a brief radar nowcast summary including start time, duration, intensity, and a placeholder direction.",
  "frontend/src/lib/radarOverlays.ts": "Generates visual overlay parameters for radar layers such as storms, snow, wind, temperature, and air quality.",
  "frontend/src/lib/rainviewer.ts": "Fetches RainViewer radar data and provides helpers for selecting playback frames and determining the initial frame.",
  "frontend/src/lib/rainviewerCache.ts": "Implements a sessionStorage-based cache for RainViewer data with a 5‑minute expiration.",
  "frontend/src/lib/routeAnalysis.ts": "Analyzes weather along a route to score risks like freezing, fog, precipitation, and wind, producing an overall risk assessment.",
  "frontend/src/lib/tirePressure.ts": "Calculates tire pressure adjustment recommendations based on temperature and vehicle type.",
  "frontend/src/lib/weatherContrast.ts": "Provides a helper to determine whether a weather theme should use a dark background.",
  "frontend/src/lib/weatherTheme.ts": "Maps WMO weather codes to themes, icons, and translation description keys.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/types/androidBridge.d.ts": "Declares a global Android interface for triggering native notifications.",
  "frontend/src/vite-env.d.ts": "Includes Vite client type definitions.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, container settings, and plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related builds, enabling ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite config enabling React, path aliasing, a dev server proxy, and build settings.",
  "project_state.json": "Tracks project state, feature requirements, and the goal of showing future nowcast radar imagery."
}