{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report describing implemented i18n, language switcher, persistence, and translation coverage with associated files and components.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing each frontend source file’s purpose and behavior.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color variables for light and dark mode and applying global styles.",
  "frontend/index.html": "HTML entry page that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React component handling layout, i18n language switching, saved location management, and weather-based theming.",
  "frontend/src/components/BackgroundIllustration.tsx": "Displays weather‑themed background images with fade transitions and theme‑aware overlay gradients.",
  "frontend/src/components/LocationSearch.tsx": "Search component for selecting and clearing locations with translated placeholders, errors, and result lists.",
  "frontend/src/components/ThemeProvider.tsx": "Context provider that applies weather‑based light or dark mode and exposes the active theme.",
  "frontend/src/components/WeatherPanel.tsx": "Displays current, hourly, and daily weather info with loading and error states using themed UI components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useGeocodingSearch.ts": "Provides debounced location search with loading and error handling for geocoding results.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth client, login state, and stored identities via a React context provider.",
  "frontend/src/hooks/usePersistedLocation.ts": "Stores and retrieves a selected location in localStorage with helpers to update or clear it.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting no backend queries are used.",
  "frontend/src/hooks/useWeather.ts": "Fetches and transforms weather data into current, hourly, and daily formats using react-query.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides locale state, persistence, and translation lookup via a React context.",
  "frontend/src/i18n/translations.ts": "Defines English and Turkish translation strings for UI text and weather condition labels.",
  "frontend/src/i18n/useI18n.ts": "Exposes translation and locale utilities by consuming the I18n context.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for themes, including weather‑based variants and dark mode.",
  "frontend/src/lib/openMeteo.ts": "Provides functions to search locations via Open‑Meteo Geocoding API and fetch weather data, along with related TypeScript interfaces.",
  "frontend/src/lib/weatherContrast.ts": "Defines a helper determining if a weather theme should be treated as dark for UI contrast.",
  "frontend/src/lib/weatherTheme.ts": "Maps weather codes to themes, icons, and translation keys for UI weather representation.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Stores project metadata, feature definitions, architectural notes, and known issues."
}