{
  "backend/main.mo": "Motoko actor defining weather data types (WeatherResponse, WeeklyForecast, DBWeather) and query functions that return hardcoded mock weather data for city/country lookups, with an unused oracle cache and snow condition helper.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive documentation of frontend component architecture, hooks, utilities, and translations with detailed implementation notes on responsive design, type safety, API integrations, and theme management.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark theme CSS variables for backgrounds, foregrounds, borders, and component colors.",
  "frontend/index.html": "HTML entry point for the WeatherVerse application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component managing location state, tab navigation (weather/farmer/driver/beach), weather data fetching, imminent alerts, backend publishing, and rendering themed UI with header, navigation, and content panels.",
  "frontend/src/components/BackgroundIllustration.tsx": "Component rendering weather-themed background images with smooth transitions and overlay gradients that adapt based on dark/light weather themes.",
  "frontend/src/components/BeachMarineScreen.tsx": "Beach/marine conditions panel displaying wave height, wave period, water temperature, wind, and visibility data fetched via useMarineConditions hook with loading and error states.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with four tabs (weather, farmer, driver, beach) featuring icons, labels, and active state styling with touch-friendly sizing.",
  "frontend/src/components/DriverWeatherPanel.tsx": "Displays driving-specific weather conditions including road ice risk, fog warnings, and route weather analysis between two locations with interactive route planning.",
  "frontend/src/components/FarmerGardenWeatherPanel.tsx": "Shows agricultural weather insights with humidity and temperature metrics relevant to farming and gardening activities.",
  "frontend/src/components/FloatingAutocompleteDropdown.tsx": "A portal-based floating dropdown component that positions itself relative to an anchor element, handles viewport flipping, and manages outside-click dismissal.",
  "frontend/src/components/ImminentWeatherAlertBanner.tsx": "Renders dismissible weather alert banners with severity-based styling and icons for rain, snow, storm, or fog conditions.",
  "frontend/src/components/InitialRenderErrorBoundary.tsx": "React error boundary that catches initial render errors and displays a fallback UI with error details and a refresh button.",
  "frontend/src/components/LanguageDropdownOverlay.tsx": "A portal-based language selector dropdown that toggles between Turkish and English locales with positioning and outside-click handling.",
  "frontend/src/components/LaundryDryingRecommendation.tsx": "Displays optimal time ranges for outdoor laundry drying based on weather conditions, showing best and alternative time windows.",
  "frontend/src/components/LocationSearch.tsx": "A location search component with autocomplete dropdown that allows users to search for locations using geocoding, displays the current selected location with admin/country details, and provides clear functionality.",
  "frontend/src/components/radar/RadarAlertBanner.tsx": "Renders a dismissible alert banner for radar alerts with severity-based styling (destructive for severe) and displays localized title and message.",
  "frontend/src/components/radar/RadarAlertControls.tsx": "A sheet-based settings panel for radar alerts that allows users to enable/disable alerts and adjust the alert radius (5-20km) with a slider control.",
  "frontend/src/components/radar/RadarEmptyState.tsx": "Displays an empty state with a cloud icon and localized message when no radar location is selected.",
  "frontend/src/components/radar/RadarForecastLabel.tsx": "Shows a centered warning label at the top of the radar view indicating forecast uncertainty with an alert icon.",
  "frontend/src/components/radar/RadarFrameModeToggle.tsx": "Empty file with no content.",
  "frontend/src/components/radar/RadarInfoPanel.tsx": "Displays a grid of radar summary information including start time, duration, precipitation intensity, and movement direction computed from radar data and playback frames.",
  "frontend/src/components/radar/RadarLayerToggles.tsx": "A sheet-based control panel that allows users to toggle visibility of different radar layers (precipitation, storm, snow, wind, temperature, air quality) using switches.",
  "frontend/src/components/radar/RadarMap.tsx": "React component that renders an interactive Leaflet map with radar precipitation overlays, weather data layers (temperature, wind, storm, snow, air quality), and location markers using RainViewer and custom overlay data.",
  "frontend/src/components/radar/RadarOverlayStatus.tsx": "Displays loading, error, and no-data status alerts for radar overlay layers (storm, snow, air quality) with localized messages positioned above the map.",
  "frontend/src/components/radar/RadarPlaybackControls.tsx": "Empty file placeholder for radar playback controls component.",
  "frontend/src/components/RadarScreen.tsx": "Empty file with no content.",
  "frontend/src/components/RouteLocationSearch.tsx": "Similar to LocationSearch but designed for route planning, allowing users to search and select locations with a label prop, displaying selected location details and providing clear functionality.",
  "frontend/src/components/ThemeProvider.tsx": "Provides weather-based theme context (clear, cloudy, rain, snow) and applies dark mode class based on weather theme, wrapping children with theme data attributes and transition effects.",
  "frontend/src/components/WeatherPanel.tsx": "Displays comprehensive weather information including current conditions, temperature, humidity, wind, visibility, AQI, UV index, and daily forecast with laundry drying recommendations, handling loading and error states.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGeocodingSearch.ts": "Hook that provides debounced location search using Open-Meteo geocoding API with React Query caching and error handling.",
  "frontend/src/hooks/useImminentWeatherAlerts.ts": "Manages imminent weather alerts with session-based dismissal cooldowns and optional Android WebView bridge notifications for severe weather conditions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication with AuthClient, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useMarineConditions.ts": "React Query hook that fetches marine/beach conditions from Open-Meteo Marine API with 5-minute stale time and 10-minute refetch interval.",
  "frontend/src/hooks/usePersistedLocation.ts": "Hook that manages user's selected location in localStorage with get, set, and clear operations for SavedLocation objects.",
  "frontend/src/hooks/usePublishWidgetWeather.ts": "Mutation hook that publishes weather data to the backend for Android widget HTTP endpoints, gracefully handling failures without throwing errors.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file documenting that all data fetching is done client-side via feature-specific hooks (Open-Meteo APIs and RainViewer).",
  "frontend/src/hooks/useRadarAlerts.ts": "Manages radar-based weather alerts with configurable radius settings, detecting heavy precipitation conditions and handling alert dismissal with session state.",
  "frontend/src/hooks/useRadarOverlayData.ts": "React Query hook that fetches radar overlay data (temperature, wind, precipitation, air quality, storm intensity) from Open-Meteo APIs and generates a temperature grid for heatmap visualization.",
  "frontend/src/hooks/useRadarPlayback.ts": "Custom hook managing radar animation playback with play/pause, frame seeking, auto-looping, and frame label generation; resets playback when frames change.",
  "frontend/src/hooks/useRainViewer.ts": "React Query hook that fetches RainViewer radar data from backend cache, validates structure, and caches locally; depends on actor availability.",
  "frontend/src/hooks/useRouteWeatherAnalysis.ts": "React Query hook that interpolates points along a route between two locations, fetches weather data for each point, and analyzes route weather conditions.",
  "frontend/src/hooks/useSessionState.ts": "Custom hook providing sessionStorage-backed state management with JSON serialization and error handling.",
  "frontend/src/hooks/useWeather.ts": "React Query hook that fetches and transforms weather and air quality data from Open-Meteo, including current conditions, hourly forecasts, daily forecasts, and pressure trend calculations.",
  "frontend/src/i18n/I18nProvider.tsx": "React context provider for internationalization that manages locale state (Turkish/English), persists to localStorage, and provides translation function.",
  "frontend/src/i18n/translations.ts": "Translation dictionary containing Turkish and English strings for all UI elements including weather conditions, navigation, advisories, and error messages.",
  "frontend/src/i18n/useI18n.ts": "Custom hook that provides access to the I18n context (locale, setLocale, translation function) with error handling for missing provider.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light/dark themes and weather-specific themes (rain, snow, clear, cloudy) using OKLCH color space, plus utility classes for glass-morphism effects.",
  "frontend/src/lib/clothingAdvisories.ts": "Generates clothing recommendations based on current and near-term weather conditions (temperature, wind, precipitation) by analyzing weather codes and returning advisory items with translation keys and icons.",
  "frontend/src/lib/driverAdvisories.ts": "Calculates road ice risk and fog warnings for drivers by analyzing temperature, precipitation, humidity, and cloud cover data over the next 6-12 hours, returning status levels (safe/caution/danger) with localized message keys.",
  "frontend/src/lib/farmerAdvisories.ts": "Provides agricultural advisories including frost warnings, soil moisture status, precipitation forecasts, planting conditions, and spraying safety by analyzing weather data over various timeframes (12-48 hours).",
  "frontend/src/lib/fetchWithTimeout.ts": "Wrapper function for fetch API that adds timeout support using AbortController, throwing a user-friendly error message when requests exceed the specified timeout (default 10 seconds).",
  "frontend/src/lib/formatDailyForecastDate.ts": "Formats ISO date strings into localized short date format (e.g., 'Mon, Jan 15') using Intl.DateTimeFormat with support for English and Turkish locales.",
  "frontend/src/lib/imminentWeatherAlerts.ts": "Evaluates the next 60 minutes of hourly weather data to detect imminent severe weather (storms, snow, rain, fog) and returns prioritized alerts with severity levels and localized message keys.",
  "frontend/src/lib/laundryDrying.ts": "Calculates laundry drying scores for each hour based on temperature, humidity, wind speed, and precipitation, classifying conditions into ideal/suitable/limited/not-suitable categories and identifying optimal drying time ranges.",
  "frontend/src/lib/openMeteo.ts": "Defines TypeScript interfaces and functions for fetching weather data from the Open-Meteo API, including current conditions, hourly forecasts, daily forecasts, air quality, and geocoding results.",
  "frontend/src/lib/openMeteoMarine.ts": "Fetches marine conditions (wave height, period, direction, sea surface temperature, wind, visibility) from Open-Meteo Marine and Forecast APIs, with fallback visibility estimation based on humidity.",
  "frontend/src/lib/radarNowcastSummary.ts": "Computes a summary of radar nowcast data including start time, duration, intensity level, and direction based on RainViewer playback frames.",
  "frontend/src/lib/radarOverlays.ts": "Provides display parameters (radius, color, opacity) for various radar overlay types (storm, snow, wind, temperature, air quality) based on weather data values.",
  "frontend/src/lib/rainviewer.ts": "Parses and normalizes RainViewer radar data, filtering nowcast frames to a 90-minute window and providing utilities to find the initial playback frame index.",
  "frontend/src/lib/rainviewerCache.ts": "Manages sessionStorage caching of RainViewer data with a 5-minute expiration, including validation and normalization for backward compatibility with old cache formats.",
  "frontend/src/lib/routeAnalysis.ts": "Analyzes weather data along a route to identify risk factors (freezing, fog, precipitation, wind) and calculates an overall risk level (safe, caution, danger) with severity ratings.",
  "frontend/src/lib/tirePressure.ts": "Calculates tire pressure recommendations based on temperature and vehicle type, adjusting from a reference temperature of 20°C with different base pressures for passenger, SUV, and commercial vehicles.",
  "frontend/src/lib/weatherContrast.ts": "Utility function to determine if a weather theme (clear, cloudy, rain, snow) should be treated as having a dark background, returning true for rain and snow themes.",
  "frontend/src/lib/weatherTheme.ts": "Maps WMO weather codes to weather themes, icons (from lucide-react), and translation keys for weather condition descriptions.",
  "frontend/src/lib/widgetWeatherPayload.ts": "Transforms frontend WeatherData into backend-compatible WeatherResponse format, generating stable location-based keys and mapping weather codes to human-readable conditions.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the App component.",
  "frontend/src/types/androidBridge.d.ts": "TypeScript declaration file defining the Android bridge interface for showing notifications from WebView.",
  "frontend/src/vite-env.d.ts": "TypeScript reference file for Vite client types.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations, shadows, and plugins for animations and typography.",
  "frontend/tsconfig.node.json": "TypeScript configuration for Node.js build tools (Vite config) with ESNext module resolution.",
  "frontend/vite.config.ts": "Vite configuration with React plugin, path aliases, dev server on port 3000 with API proxy to localhost:4943, and build output to dist directory.",
  "project_state.json": "Project state tracking file indicating a fix request to wrap the App component with I18nProvider in main.tsx to resolve a missing provider error."
}