{
  "kind": "build_request",
  "title": "WeatherVerse branding + imminent weather alerts with optional Android WebView notification bridge",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update app branding so the name \"WeatherVerse\" is displayed consistently across the web app (HTML document title and in-app header title) for all locales.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-13",
          "recent-15"
        ],
        "quotes": [
          "Uygulama ismini WeatherVerse olarak işle uygulama ismi olarak her yerde WeatherVerse ismi gözüksün",
          "başla"
        ]
      },
      "acceptanceCriteria": [
        "The browser tab/title in `frontend/index.html` is \"WeatherVerse\".",
        "The in-app header title (currently `t('header.title')` in `frontend/src/App.tsx`) renders \"WeatherVerse\" in both English and Turkish locales.",
        "No other user-facing title string contradicts the WeatherVerse name."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement an imminent weather event alert system that detects if rain, snow, storm/thunderstorm, or fog is expected within approximately the next 1 hour for the selected location, and displays an in-app alert banner when triggered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-4"
        ],
        "quotes": [
          "Birşey soracağım mesele kısa şöyle bildirimler vermemiz mümkün mü yağmur başlayacak, kar başlayacak, fırtına başlayacak, sis etkili olacak gib isinden işte 1 saate filan diye"
        ]
      },
      "acceptanceCriteria": [
        "When a location is selected and weather data is available, the app evaluates the next ~1 hour of forecast data and determines whether any of: rain, snow, storm/thunderstorm, fog is imminent.",
        "If at least one imminent event is detected, an alert banner is shown in the UI (in-app), with a clear title and message in English when locale is EN and in Turkish when locale is TR.",
        "The alert banner can be dismissed, and dismissal prevents it from immediately reappearing for the same event unless the detected event changes or a reasonable time window has passed (persist the dismissal state in sessionStorage or localStorage).",
        "The implementation does not require any backend changes; it runs purely in the frontend using the existing Open-Meteo-derived `weatherData` from `useWeather`."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an optional JavaScript-to-Android WebView bridge integration that, when an imminent weather alert is detected, calls an Android-provided bridge function (if present) so the native Android layer can display a system notification.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-12"
        ],
        "quotes": [
          "web tarafından çağrı gitse anroid tarafı da bildirimi gösterse olur mu?"
        ]
      },
      "acceptanceCriteria": [
        "The web app checks for the presence of an Android bridge function on `window` (e.g., `window.Android.showNotification`) before calling it; if absent, the app continues without errors.",
        "When an imminent weather alert is newly triggered (not repeatedly on every re-render/refetch), the app invokes the bridge with enough information for Android to show a notification (at minimum: title and message; optionally include a type/severity).",
        "Duplicate Android bridge calls are suppressed for the same alert within a short cooldown window (e.g., tracked via sessionStorage/localStorage) so the native side does not spam notifications.",
        "TypeScript is satisfied (add a safe `declare global` typing for `window.Android` in a non-immutable path)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Choose and apply a cohesive visual theme for WeatherVerse (colors, typography, and component styling) that fits a modern weather-alert dashboard, and use it consistently for the new alert banner and any new UI controls added for alerts/bridge behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-15"
        ],
        "quotes": [
          "başla"
        ]
      },
      "acceptanceCriteria": [
        "A single, coherent visual direction is applied (e.g., warm neutrals + high-contrast accent) without introducing new product features.",
        "New alert UI uses the existing Tailwind + shadcn components and matches existing glass-surface styling conventions.",
        "No blue/purple-dominant theme is introduced unless it already exists in the project tokens."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`.",
    "Backend must remain single-actor (`backend/main.mo`); do not introduce additional backend services.",
    "Do not implement real web push notifications (not supported on this platform); only in-app alerts and an optional WebView bridge call are in scope."
  ],
  "nonGoals": [
    "Building or configuring the native Android notification system in Android Studio (assumed to be handled by the user).",
    "Implementing APNs/FCM, service workers, or any true push notification delivery from the Internet Computer.",
    "Adding external databases or third-party auth providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}