{
  "kind": "build_request",
  "title": "Show upcoming-hours (nowcast) radar/cloud imagery instead of past frames",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update RainViewer radar data parsing so the app can prefer upcoming-hours (nowcast) frames instead of historical (past) frames for radar playback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "radarda bulutların geçmiş görüntüsü değil ilerleyen saatlerdeki görüntüsünü istiyorum"
        ]
      },
      "acceptanceCriteria": [
        "The RainViewer fetch/parsing layer preserves a distinction between past frames and nowcast (future) frames (e.g., separate arrays or equivalent metadata), rather than only providing a single combined list.",
        "Radar playback can be configured to use only nowcast frames for the timeline and animation when nowcast frames are available.",
        "If the RainViewer API response contains no nowcast frames, the app falls back to past frames to avoid an empty radar experience."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change the Radar screen playback behavior so that the default displayed/played frames are future/nowcast frames (upcoming hours) rather than past frames.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "radarda bulutların geçmiş görüntüsü değil ilerleyen saatlerdeki görüntüsünü istiyorum"
        ]
      },
      "acceptanceCriteria": [
        "When a location is selected and radar data loads, the timeline/slider range represents upcoming (nowcast) frames by default (not historical frames).",
        "The initial selected frame is the earliest available nowcast frame at/after the current time (or the closest available upcoming frame), not a past frame.",
        "The 'Past' vs 'Nowcast/Forecast' indicator shown in the playback controls reflects the new default behavior (i.e., it should show the nowcast/forecast state under normal conditions)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the Radar map overlay uses the same nowcast frame selection used by playback controls, so the visible radar tiles correspond to the chosen upcoming-hours frame index.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "radarda bulutların geçmiş görüntüsü değil ilerleyen saatlerdeki görüntüsünü istiyorum"
        ]
      },
      "acceptanceCriteria": [
        "Changing the radar frame via the slider/buttons updates the map precipitation tile layer to the corresponding nowcast frame path.",
        "No past frame is displayed on the map when nowcast frames are available and nowcast mode is active by default.",
        "Radar alerts logic continues to function with the updated frame list and does not crash when the frame list composition changes (past vs nowcast)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead).",
    "Keep the backend as a single Motoko actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Adding a brand-new radar provider or switching away from the RainViewer API.",
    "Implementing real-time radar streaming beyond the existing periodic refresh behavior.",
    "Adding a backend persistence layer for radar frames or user preferences."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}