{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore Radar tab between Driver and Beach tabs",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add Radar tab to the bottom navigation between Driver tab and Beach tabs using the existing BottomNav component structure",
      "acceptanceCriteria": [
        "Radar tab appears in bottom navigation between Driver and Beach tabs",
        "Tab uses appropriate radar/weather icon",
        "Tab label is internationalized in Turkish and English",
        "Active state styling matches other tabs in BottomNav"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BottomNav.tsx",
          "operation": "modify",
          "description": "Add 'radar' as the third tab option between 'driver' and 'beach' tabs. Insert a new tab button with a Radar icon (use Lucide-React's 'Radar' icon) and the translation key 'nav.radar'. Ensure the tab ordering is: weather, farmer, driver, radar, beach. Match the existing glass morphism styling and active state behavior for the new radar tab."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Create RadarScreen component that uses the location from the main weather location state to display weather radar visualization",
      "acceptanceCriteria": [
        "RadarScreen component receives location from App.tsx location state",
        "Component only renders when a location is selected",
        "Shows appropriate empty state when no location is available"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RadarScreen.tsx",
          "operation": "modify",
          "description": "Create RadarScreen component that accepts location and weatherData props (same structure as BeachMarineScreen and other panels). Check if location exists; if not, render the existing RadarEmptyState component. If location exists, render a container with the RadarMap component (to be integrated in REQ-3). Include loading states and error handling. Use the same panel layout patterns as WeatherPanel and BeachMarineScreen for consistency."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Integrate existing RadarMap component into RadarScreen to display cloud and precipitation layers on the map using the weather API data",
      "acceptanceCriteria": [
        "RadarMap component renders with cloud and precipitation overlays",
        "Map centers on the selected location coordinates",
        "Weather data from API is fetched and displayed on map layers",
        "Map shows current cloud cover and precipitation intensity"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RadarScreen.tsx",
          "operation": "modify",
          "description": "Integrate the existing RadarMap component into RadarScreen's layout. Pass location coordinates and weather data to RadarMap. Use the existing useRainViewer hook to fetch radar frame data and useRadarOverlayData hook to get overlay information (temperature, wind, precipitation, air quality, storm). Ensure the map is properly sized within the screen container and centers on the provided location coordinates. Include RadarLayerToggles, RadarInfoPanel, and RadarOverlayStatus components as part of the radar screen interface to provide full radar functionality matching the existing radar implementation patterns."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Wire up the Radar tab in App.tsx to conditionally render RadarScreen when the radar tab is active, following the same pattern as other tabs",
      "acceptanceCriteria": [
        "App.tsx activeTab state includes 'radar' option",
        "RadarScreen renders when activeTab === 'radar'",
        "Tab switching works smoothly between all tabs including radar",
        "Location prop is passed from App.tsx to RadarScreen"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the activeTab type definition to include 'radar' as a valid option (between 'driver' and 'beach'). Add a conditional rendering block for RadarScreen that checks if activeTab === 'radar', passing location and weatherData props from App.tsx state. Follow the same pattern used for WeatherPanel, FarmerGardenWeatherPanel, DriverWeatherPanel, and BeachMarineScreen. Import the RadarScreen component at the top of the file. Ensure tab state changes properly trigger re-renders and that the radar screen receives updated location data when it changes."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add internationalization strings for the Radar tab label in both Turkish and English to the translations dictionary",
      "acceptanceCriteria": [
        "Translation keys added to translations.ts",
        "Turkish translation displays correctly",
        "English translation displays correctly",
        "Tab label updates when language is changed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add 'nav.radar' translation key to both 'tr' and 'en' translation objects. Set the Turkish translation to 'Radar' and the English translation to 'Radar'. Place the new key in the 'nav' section alongside existing navigation translations (nav.weather, nav.farmer, nav.driver, nav.beach). Ensure the key is accessible via the translation function and will be used by BottomNav component."
        }
      ]
    }
  ]
}