{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-16T23:59:05.158Z",
  "summary": "Diff adds some frontend RainViewer hooks/utilities and a backend migration type/map for RainViewer metadata cache, but the provided diff summary does not show concrete backend RainViewer fetch/proxy implementations (metadata fetch + TTL lazy-refresh + tile PNG proxy) nor a health-check method. Because backend/main.mo is truncated, some items may exist outside the visible excerpt; findings below are based only on what is evidenced in the diff summary.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Backend method that fetches RainViewer public JSON metadata from https://api.rainviewer.com/public/weather-maps.json, normalizes to stable structure (host, past/nowcast/combined frames), and returns safe error/empty result on invalid payload.",
      "reason": "The diff summary does not include any visible backend code that performs an HTTP outcall to RainViewer’s weather-maps.json, parses/validates it, or exposes a public method returning the normalized structure. Frontend expects a backend method, but its backend implementation is not evidenced in the shown backend/main.mo excerpt.",
      "evidence": [
        "backend/main.mo (truncated)",
        "frontend/src/lib/rainviewer.ts (calls actor.fetchAndCacheRainViewerMetadata())"
      ]
    },
    {
      "id": "REQ-2",
      "requirement": "Backend cache for RainViewer JSON metadata with TTL=10 minutes and lazy-refresh: serve cached within TTL; after TTL serve last value immediately and trigger at most one background refresh; store fetch timestamp.",
      "reason": "While a RainViewerMetadata type includes a timestamp and a rainViewerMetadataCache map is added in migration, the diff summary does not show any TTL logic (10 minutes), lazy-refresh behavior, or single in-flight refresh/dedup implementation in backend/main.mo.",
      "evidence": [
        "backend/migration.mo (adds RainViewerMetadata.timestamp and rainViewerMetadataCache)",
        "backend/main.mo (truncated)"
      ]
    },
    {
      "id": "REQ-3",
      "requirement": "Backend tile proxy method to fetch RainViewer PNG tiles and return bytes; must guard invalid z/x/y and enforce zoom range 5–9.",
      "reason": "No backend method for tile fetching/proxying (PNG bytes) is shown in the diff summary, and no z/x/y validation or zoom-range guarding is evidenced.",
      "evidence": [
        "backend/main.mo (truncated)"
      ]
    },
    {
      "id": "REQ-4",
      "requirement": "Minimize redundant RainViewer requests: dedupe concurrent metadata refreshes (single in-flight), and avoid repeated outbound calls for identical tile requests when caching is enabled/feasible.",
      "reason": "The diff summary does not show any concurrency/in-flight dedup for metadata refreshes, nor any tile request caching/dedup mechanism.",
      "evidence": [
        "backend/main.mo (truncated)"
      ]
    },
    {
      "id": "REQ-5",
      "requirement": "Keep or provide a backend health check method returning status + version + timestamp (or equivalent).",
      "reason": "The diff summary does not show any health check method in backend/main.mo; the visible portion only shows weather-related query methods.",
      "evidence": [
        "backend/main.mo (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Client-side RainViewer caching strategy and refresh cadence via React Query (staleTime/refetchInterval 5 minutes; gcTime 10 minutes) plus local cache validation logic.",
      "reason": "The BuildRequest focuses on backend proxy/cache and does not request implementing client-side RainViewer caching/refresh policies. This is additional behavior beyond the backend cache requirements.",
      "evidence": [
        "frontend/src/hooks/useRainViewer.ts",
        "frontend/src/hooks/useQueries.ts"
      ]
    },
    {
      "description": "Frontend utilities for splitting frames by current time and choosing initial playback frame index.",
      "reason": "Frontend radar/timeline/animation work is explicitly listed as a non-goal for this step; these helpers are frontend radar playback-related logic.",
      "evidence": [
        "frontend/src/lib/rainviewer.ts"
      ]
    },
    {
      "description": "Added backend migration module with extensive weather-related types plus RainViewer metadata cache map initialization.",
      "reason": "The BuildRequest is about RainViewer proxy/cache; adding/retaining large unrelated weather schema in a new migration module is not requested in the described scope (though it may be incidental to the project).",
      "evidence": [
        "backend/migration.mo"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/hooks/useRainViewer.ts",
    "frontend/src/lib/rainviewer.ts",
    "project_state.json"
  ]
}